package buhuchet;

import java.awt.*;
import javax.swing.*;
import javax.swing.table.*;

public class Header {
    Buhuchet signin;
    ParamsTables zpt;
    String dbn;
    JTable table;

    JPanel panel() {
        JPanel p=new JPanel(false);
        if (zpt.dbName.equals("podpis")||zpt.dbName.equals("podpis2")) p.setBackground(Color.WHITE);
        else p.setBackground(new Color(238,238,238));
        p.setLayout(new BoxLayout(p,BoxLayout.Y_AXIS)); p.setLayout(new GridLayout(0,1)); return p;
    }
    JLabel L(int b,int r,int f,int a,String s) {
        JLabel l=new JLabel(s,a); l.setBorder(BorderFactory.createMatteBorder(0,0,b,r,Color.BLACK));
        l.setFont(new Font("Times New Roman",Font.BOLD,f+2)); return l;
    }
    JLabel L(int b,int r,int f,int a,String s,int fbold) {
        JLabel l=new JLabel(s,a); l.setBorder(BorderFactory.createMatteBorder(0,0,b,r,Color.BLACK));
        l.setFont(new Font("Times New Roman",fbold,f+2)); return l;
    }
    class JComponentTableCellRenderer implements TableCellRenderer {
        public Component getTableCellRendererComponent(JTable table, Object value,boolean isSelected,boolean hasFocus,
                                                       int row,int column) {return (JComponent)value;}
    }
    public Header(Buhuchet signinx,ParamsTables zptx,JTable tablex,String dbnx) {
        signin=signinx; zpt=zptx; table=tablex; dbn=dbnx; int al1=JLabel.LEFT; int al2=JLabel.CENTER; int al3=JLabel.RIGHT;
        TableCellRenderer renderer=new JComponentTableCellRenderer(); TableColumnModel cModel=table.getColumnModel();
        int n=cModel.getColumnCount(); JPanel[] p=new JPanel[n];
        for (int i=0; i<n; i++) {
            p[i]=panel(); TableColumn cns=cModel.getColumn(i); cns.setHeaderRenderer(renderer); cns.setHeaderValue(p[i]);
        }
        String[] xtxzpt=dbn.split("_");
        String[] sw=zpt.dbName.split("_"); int l=0; int k=0;
        if (sw.length>1&&!xtxzpt[0].equals("users")) {l=new Integer(sw[2]); k=new Integer(sw[3]);}
        int fb=Font.BOLD; int fp=Font.PLAIN;
        if (xtxzpt[0].equals("users")) {
            p[0].add(L(1,1,10,al2,"№",fb));
            p[1].add(L(1,1,10,al2,"Код"));
            p[2].add(L(1,1,10,al2,"Наименование"));
            return;
        }
        if (dbn.equals("podpis")) {
            p[0].add(L(0,0,10,al2,"",fb));
            p[1].add(L(0,0,10,al2,"",fb));
            p[2].add(L(0,0,10,al2,"",fb));
            p[3].add(L(0,0,10,al2,"",fb));
            return;
        }
        if (dbn.equals("podpis2")) {
            p[0].add(L(0,0,10,al2,"",fb));
            p[1].add(L(0,0,10,al2,"",fb));
            p[2].add(L(0,0,10,al2,"",fb));
            p[3].add(L(0,0,10,al2,"",fb));
            return;
        }
        p[0].add(L(1,1,10,al2,"№",fb));
        if (dbn.equals("t1")) {
            p[1].add(L(0,1,10,al2,"ТЕРГОВЧИЛАР ТОМОНИДАН",fb));
            p[1].add(L(0,1,10,al2,"ТАМОМЛАНГАН ЖИНОИЙ ИШЛАР",fb));
            p[1].add(L(0,1,10,al2,"(такрорийларсиз)",fb));
            p[1].add(L(1,1,10,al2,"",fb));
            p[1].add(L(1,1,10,al2,"a",fb));

            p[2].add(L(0,1,10,al2,"",fb));
            p[2].add(L(0,1,10,al2,"",fb));
            p[2].add(L(0,1,10,al2,"",fb));
            p[2].add(L(1,1,10,al2,"",fb));
            p[2].add(L(1,1,10,al2,"б",fb));
//
            p[3].add(L(0,0,10,al2,"Айблов",fb));
            p[3].add(L(1,0,10,al3,"юб",fb));
            p[3].add(L(1,0,10,al3,"Проку",fb));
            p[3].add(L(1,1,10,al2,"иш",fb));
            p[3].add(L(1,1,10,al2,"1",fb));

            p[4].add(L(0,0,10,al2,"хулосаси",fb));
            p[4].add(L(1,0,10,al1,"орилган",fb));
            p[4].add(L(1,1,10,al1,"ратура",fb));
            p[4].add(L(1,1,10,al2,"шахс",fb));
            p[4].add(L(1,1,10,al2,"2",fb));

            p[5].add(L(0,0,10,al2,"билан",fb));
            p[5].add(L(1,0,10,al2,"ишлар",fb));
            p[5].add(L(1,0,10,al3,"ИИ",fb));
            p[5].add(L(1,1,10,al2,"иш",fb));
            p[5].add(L(1,1,10,al2,"3",fb));

            p[6].add(L(0,1,10,al1,"судга",fb));
            p[6].add(L(1,1,10,al1,"",fb));
            p[6].add(L(1,1,10,al1,"В",fb));
            p[6].add(L(1,1,10,al2,"шахс",fb));
            p[6].add(L(1,1,10,al2,"4",fb));
//
            p[7].add(L(0,0,10,al3,"Тугат",fb));
            p[7].add(L(1,0,10,al3,"иш",fb));
            p[7].add(L(0,1,10,al2,"Прок.",fb));
            p[7].add(L(1,1,10,al2,"",fb));
            p[7].add(L(1,1,10,al2,"5",fb));

            p[8].add(L(0,1,10,al1,"илган",fb));
            p[8].add(L(1,1,10,al1,"лар",fb));
            p[8].add(L(0,1,10,al2,"ИИВ",fb));
            p[8].add(L(1,1,10,al2,"",fb));
            p[8].add(L(1,1,10,al2,"6",fb));
//
            p[9].add(L(0,0,10,al3,"Яраш",fb));
            p[9].add(L(1,0,10,al3,"ю",fb));
            p[9].add(L(1,0,10,al3,"Проку",fb));
            p[9].add(L(1,1,10,al2,"иш",fb));
            p[9].add(L(1,1,10,al2,"7",fb));

            p[10].add(L(0,0,10,al1,"ув тартиби",fb));
            p[10].add(L(1,0,10,al1,"борилган",fb));
            p[10].add(L(1,1,10,al1,"ратура",fb));
            p[10].add(L(1,1,10,al2,"шахс",fb));
            p[10].add(L(1,1,10,al2,"8",fb));

            p[11].add(L(0,0,10,al1,"да судга",fb));
            p[11].add(L(1,0,10,al1,"ишлар",fb));
            p[11].add(L(1,0,10,al3,"ИИ",fb));
            p[11].add(L(1,1,10,al2,"иш",fb));
            p[11].add(L(1,1,10,al2,"9",fb));

            p[12].add(L(0,1,10,al2,"",fb));
            p[12].add(L(1,1,10,al1,"",fb));
            p[12].add(L(1,1,10,al1,"В",fb));
            p[12].add(L(1,1,10,al2,"шахс",fb));
            p[12].add(L(1,1,10,al2,"10",fb));
//
            p[13].add(L(0,0,10,al3,"Амнист",fb));
            p[13].add(L(1,0,10,al3,"юб",fb));
            p[13].add(L(1,0,10,al3,"Проку",fb));
            p[13].add(L(1,1,10,al2,"иш",fb));
            p[13].add(L(1,1,10,al2,"11",fb));

            p[14].add(L(0,0,10,al1,"ия тартиб",fb));
            p[14].add(L(1,0,10,al1,"орилган",fb));
            p[14].add(L(1,1,10,al1,"ратура",fb));
            p[14].add(L(1,1,10,al2,"шахс",fb));
            p[14].add(L(1,1,10,al2,"12",fb));

            p[15].add(L(0,0,10,al1,"ида судга",fb));
            p[15].add(L(1,0,10,al1,"ишлар",fb));
            p[15].add(L(1,0,10,al3,"ИИ",fb));
            p[15].add(L(1,1,10,al2,"иш",fb));
            p[15].add(L(1,1,10,al2,"13",fb));

            p[16].add(L(0,1,10,al1,"",fb));
            p[16].add(L(1,1,10,al1,"",fb));
            p[16].add(L(1,1,10,al1,"В",fb));
            p[16].add(L(1,1,10,al2,"шахс",fb));
            p[16].add(L(1,1,10,al2,"14",fb));
        }
        if (dbn.equals("t6")) {
            p[1].add(L(0,0,10,al2,"",fb));
            p[1].add(L(0,0,10,al2,"ЖАДВАЛ 4. КУШИМЧА ТЕРГОВ",fb));
            p[1].add(L(0,0,10,al3,"ДАСТЛАБКИ ТЕРГОВ",fb));
            p[1].add(L(0,0,10,al3,"ЖИНОЯТ ИШЛАР",fb));
            p[1].add(L(0,0,10,al3,"(такрорий",fb));
            p[1].add(L(0,0,10,al2,"",fb));
            p[1].add(L(1,0,10,al2,"",fb));
            p[1].add(L(1,0,10,al2,"",fb));

            p[2].add(L(0,1,10,al2,"",fb));
            p[2].add(L(0,1,10,al1,"ХАМДА УМУМИЙ КОИДАЛАР БУЙИЧА",fb));
            p[2].add(L(0,1,10,al1,"ЮРИТИШ УЧУН КАЙТАРИЛГАН",fb));
            p[2].add(L(0,1,10,al1,"ИНИНГ НАТИЖАЛАРИ ",fb));
            p[2].add(L(0,1,10,al1,"лари билан)",fb));
            p[2].add(L(0,1,10,al2,"",fb));
            p[2].add(L(1,1,10,al2,"",fb));
            p[2].add(L(1,1,10,al1,"a",fb));

            p[3].add(L(0,1,10,al2,"",fb));
            p[3].add(L(0,1,10,al2,"",fb));
            p[3].add(L(0,1,10,al1,"",fb));
            p[3].add(L(0,1,10,al2,"",fb));
            p[3].add(L(0,1,10,al1,"",fb));
            p[3].add(L(0,1,10,al2,"",fb));
            p[3].add(L(1,1,10,al2,"",fb));
            p[3].add(L(1,1,10,al2,"б",fb));

            p[4].add(L(0,0,10,al2,"",fb));
            p[4].add(L(0,0,10,al2,"",fb));
            p[4].add(L(0,0,10,al3,"Жа",fb));
            p[4].add(L(0,0,10,al2,"",fb));
            p[4].add(L(1,0,10,al2,"",fb));
            p[4].add(L(0,1,10,al2,"Проку-",fb));
            p[4].add(L(1,1,10,al2,"ратура",fb));
            p[4].add(L(1,1,10,al2,"1",fb));

            p[5].add(L(0,1,10,al1,"",fb));
            p[5].add(L(0,1,10,al1,"",fb));
            p[5].add(L(0,1,10,al1,"ми",fb));
            p[5].add(L(0,1,10,al1,"",fb));
            p[5].add(L(1,1,10,al1,"",fb));
            p[5].add(L(0,1,10,al2,"ИИВ",fb));
            p[5].add(L(1,1,10,al2,"",fb));
            p[5].add(L(1,1,10,al2,"2",fb));

            p[6].add(L(1,0,10,al3,"",fb));
            p[6].add(L(0,0,10,al3,"Айблов хул",fb));
            p[6].add(L(0,0,10,al3,"юборилиб,",fb));
            p[6].add(L(0,0,10,al3,"терговга ",fb));
            p[6].add(L(1,0,10,al3,"ишла",fb));
            p[6].add(L(0,1,10,al2,"Проку-",fb));
            p[6].add(L(1,1,10,al2,"ратура",fb));
            p[6].add(L(1,1,10,al2,"3",fb));

            p[7].add(L(1,0,10,al1,"",fb));
            p[7].add(L(0,1,10,al1,"осаси билан",fb));
            p[7].add(L(0,1,10,al1,"кушимча",fb));
            p[7].add(L(0,1,10,al1,"кайтарилган",fb));
            p[7].add(L(1,1,10,al1,"рдан",fb));
            p[7].add(L(0,1,10,al2,"ИИВ",fb));
            p[7].add(L(1,1,10,al2,"",fb));
            p[7].add(L(1,1,10,al2,"4",fb));

            p[8].add(L(1,0,10,al3,"Шун",fb));
            p[8].add(L(0,0,10,al3,"Ярашув ",fb));
            p[8].add(L(0,0,10,al3,"ишла",fb));
            p[8].add(L(0,0,10,al2,"",fb));
            p[8].add(L(1,0,10,al2,"",fb));
            p[8].add(L(0,1,10,al2,"Проку-",fb));
            p[8].add(L(1,1,10,al2,"ратура",fb));
            p[8].add(L(1,1,10,al2,"5",fb));

            p[9].add(L(1,0,10,al1,"дан",fb));
            p[9].add(L(0,1,10,al1,"хакидаги",fb));
            p[9].add(L(0,1,10,al1,"рдан",fb));
            p[9].add(L(0,1,10,al2,"",fb));
            p[9].add(L(1,1,10,al2,"",fb));
            p[9].add(L(0,1,10,al2,"ИИВ",fb));
            p[9].add(L(1,1,10,al2,"",fb));
            p[9].add(L(1,1,10,al2,"6",fb));

            p[10].add(L(1,0,10,al3,"",fb));
            p[10].add(L(0,0,10,al3,"Амнистия ",fb));
            p[10].add(L(0,0,10,al3,"ишла",fb));
            p[10].add(L(0,0,10,al3,"",fb));
            p[10].add(L(1,0,10,al3,"",fb));
            p[10].add(L(0,1,10,al2,"Проку-",fb));
            p[10].add(L(1,1,10,al2,"ратура",fb));
            p[10].add(L(1,1,10,al2,"7",fb));

            p[11].add(L(1,1,10,al1,"",fb));
            p[11].add(L(0,1,10,al1,"хакидаги",fb));
            p[11].add(L(0,1,10,al1,"рдан",fb));
            p[11].add(L(0,1,10,al1,"",fb));
            p[11].add(L(1,1,10,al1,"",fb));
            p[11].add(L(0,1,10,al2,"ИИВ",fb));
            p[11].add(L(1,1,10,al2,"",fb));
            p[11].add(L(1,1,10,al2,"8",fb));
        }
        if (dbn.equals("t4")) {
            p[1].add(L(0,0,10,al3,"ЖАДВ",fb));
            p[1].add(L(1,0,10,al2,"",fb));
            p[1].add(L(1,0,10,al2,"",fb));

            p[2].add(L(0,1,10,al1,"АЛ 2.ЖИНОЯТ ИШИНИ ТУГАТИШ АСОСЛАРИ",fb));
            p[2].add(L(1,1,10,al2,"(такрорийларсиз)",fb));
            p[2].add(L(1,1,10,al2,"a",fb));

            p[3].add(L(0,1,10,al2,"",fb));
            p[3].add(L(1,1,10,al2,"",fb));
            p[3].add(L(1,1,10,al2,"б",fb));

            p[4].add(L(0,1,10,al2,"Прокура-",fb));
            p[4].add(L(1,1,10,al2,"тура",fb));
            p[4].add(L(1,1,10,al2,"1",fb));

            p[5].add(L(0,1,10,al2,"ИИВ",fb));
            p[5].add(L(1,1,10,al2,"",fb));
            p[5].add(L(1,1,10,al2,"2",fb));
        }
        if (dbn.equals("t5")) {
            p[1].add(L(0,0,10,al2,"",fb));
            p[1].add(L(0,0,10,al3,"ЖАДВ",fb));
            p[1].add(L(0,0,10,al2,"",fb));
            p[1].add(L(0,0,10,al2,"",fb));
            p[1].add(L(0,0,10,al2,"",fb));
            p[1].add(L(1,0,10,al2,"",fb));
            p[1].add(L(1,0,10,al2,"",fb));

            p[2].add(L(0,0,10,al2,"",fb));
            p[2].add(L(0,0,10,al1,"АЛ 3.ЖИНОЯТ ИШЛАРИНИ КУШИМЧА ТЕРГОВ ХАМДА УМУМИЙ КОИДАЛАР",fb));
            p[2].add(L(0,0,10,al2,"БУЙИЧА ДАСТЛАБКИ ТЕРГОВ ЮРИТИШ УЧУН КАЙТАРИШ (такрорийлари билан)",fb));
            p[2].add(L(0,0,10,al2,"",fb));
            p[2].add(L(0,0,10,al2,"",fb));
            p[2].add(L(1,0,10,al2,"",fb));
            p[2].add(L(1,1,10,al2,"a",fb));

            p[3].add(L(0,1,10,al2,"",fb));
            p[3].add(L(0,1,10,al2,"",fb));
            p[3].add(L(0,1,10,al2,"",fb));
            p[3].add(L(0,1,10,al2,"",fb));
            p[3].add(L(0,1,10,al2,"",fb));
            p[3].add(L(1,1,10,al2,"",fb));
            p[3].add(L(1,1,10,al2,"б",fb));

            p[4].add(L(0,0,10,al3,"Хисобот   дав",fb));
            p[4].add(L(0,0,10,al3,"буйича дастл",fb));
            p[4].add(L(1,0,10,al3,"",fb));
            p[4].add(L(1,0,10,al3,"Проку",fb));
            p[4].add(L(0,1,10,al2,"Прокурор",fb));
            p[4].add(L(1,1,10,al2,"кайтарган",fb));
            p[4].add(L(1,1,10,al2,"1",fb));

            p[5].add(L(0,0,10,al1,"рида    кушимча",fb));
            p[5].add(L(0,0,10,al1,"абки тергов юрити",fb));
            p[5].add(L(1,0,10,al1,"юритувга олинган",fb));
            p[5].add(L(1,1,10,al1,"ратура",fb));
            p[5].add(L(0,1,10,al2,"Суд",fb));
            p[5].add(L(1,1,10,al2,"кайтарган",fb));
            p[5].add(L(1,1,10,al2,"2",fb));

            p[6].add(L(0,0,10,al1,"тергов ёки умумий",fb));
            p[6].add(L(0,0,10,al1,"ш учун кайтариб,",fb));
            p[6].add(L(1,0,10,al1,"жиноят ишлари",fb));
            p[6].add(L(1,0,10,al3,"ИИ",fb));
            p[6].add(L(0,1,10,al2,"Прокурор",fb));
            p[6].add(L(1,1,10,al2,"кайтарган",fb));
            p[6].add(L(1,1,10,al2,"3",fb));

            p[7].add(L(0,1,10,al1,"коидалар",fb));
            p[7].add(L(0,1,10,al1,"иш",fb));
            p[7].add(L(1,1,10,al1,"",fb));
            p[7].add(L(1,1,10,al1,"В",fb));
            p[7].add(L(0,1,10,al2,"Суд",fb));
            p[7].add(L(1,1,10,al2,"кайтарган",fb));
            p[7].add(L(1,1,10,al2,"4",fb));
        }
        if (dbn.equals("t7")) {
            p[1].add(L(0,1,10,al2,"",fb));
            p[1].add(L(0,1,10,al2,"",fb));
            p[1].add(L(0,1,10,al2,"ЖАДВАЛ 5. Тергов жараенида жиноят натижасида ",fb));
            p[1].add(L(0,1,10,al2,"етказилган зарарни  ундиришни таъминлаш",fb));
            p[1].add(L(0,1,10,al2,"(минг сум хисобида)",fb));
            p[1].add(L(0,1,10,al2,"",fb));
            p[1].add(L(1,1,10,al2,"",fb));
            p[1].add(L(1,1,10,al2,"а",fb));

            p[2].add(L(0,1,10,al2,"",fb));
            p[2].add(L(0,1,10,al2,"",fb));
            p[2].add(L(0,1,10,al2,"",fb));
            p[2].add(L(0,1,10,al2,"",fb));
            p[2].add(L(0,1,10,al2,"",fb));
            p[2].add(L(0,1,10,al2,"",fb));
            p[2].add(L(1,1,10,al2,"",fb));
            p[2].add(L(1,1,10,al2,"б",fb));

            p[3].add(L(1,0,10,al3,"",fb));
            p[3].add(L(0,1,10,al2,"Узгалар",fb));
            p[3].add(L(0,1,10,al2,"мулкини",fb));
            p[3].add(L(0,1,10,al2,"талон тарож",fb));
            p[3].add(L(0,1,10,al2,"килиш",fb));
            p[3].add(L(0,1,10,al2,"164-169 м.м.",fb));
            p[3].add(L(1,1,10,al2,"",fb));
            p[3].add(L(1,1,10,al2,"1",fb));

            p[4].add(L(1,0,10,al3,"Прокур",fb));
            p[4].add(L(0,1,10,al2,"Узгалар мулк",fb));
            p[4].add(L(0,1,10,al2,"ни т.т килиш",fb));
            p[4].add(L(0,1,10,al2,"б-н боглик",fb));
            p[4].add(L(0,1,10,al2,"булмаган",fb));
            p[4].add(L(0,1,10,al2,"жиноятлар",fb));
            p[4].add(L(1,1,10,al2,"170-174мм",fb));
            p[4].add(L(1,1,10,al2,"2",fb));

            p[5].add(L(1,0,10,al1,"атура",fb));
            p[5].add(L(0,1,10,al2,"Уз.Р ЖПК",fb));
            p[5].add(L(0,1,10,al2,"нинг",fb));
            p[5].add(L(0,1,10,al2,"182-190",fb));
            p[5].add(L(0,1,10,al2,"моддалар",fb));
            p[5].add(L(0,1,10,al2,"",fb));
            p[5].add(L(1,1,10,al2,"",fb));
            p[5].add(L(1,1,10,al2,"3",fb));

            p[6].add(L(1,0,10,al1,"",fb));
            p[6].add(L(0,1,10,al2,"Бошка",fb));
            p[6].add(L(0,1,10,al2,"жиноят",fb));
            p[6].add(L(0,1,10,al2,"лар",fb));
            p[6].add(L(0,1,10,al2,"",fb));
            p[6].add(L(0,1,10,al2,"",fb));
            p[6].add(L(1,1,10,al2,"",fb));
            p[6].add(L(1,1,10,al2,"4",fb));

            p[7].add(L(1,1,10,al1,"",fb));
            p[7].add(L(0,1,10,al2,"Шу жумла",fb));
            p[7].add(L(0,1,10,al2,"дан терроризм",fb));
            p[7].add(L(0,1,10,al2,"ва жин.фаол",fb));
            p[7].add(L(0,1,10,al2,"олин.даром.",fb));
            p[7].add(L(0,1,10,al2,"легалл",fb));
            p[7].add(L(1,1,10,al2,"(155,243-мм)",fb));
            p[7].add(L(1,1,10,al2,"5",fb));

            p[8].add(L(1,0,10,al3,"",fb));
            p[8].add(L(0,1,10,al2,"Узгалар",fb));
            p[8].add(L(0,1,10,al2,"мулкини",fb));
            p[8].add(L(0,1,10,al2,"талон тарож",fb));
            p[8].add(L(0,1,10,al2,"килиш",fb));
            p[8].add(L(0,1,10,al2,"164-169 м.м.",fb));
            p[8].add(L(1,1,10,al2,"",fb));
            p[8].add(L(1,1,10,al2,"6",fb));

            p[9].add(L(1,0,10,al3,"ИИВ",fb));
            p[9].add(L(0,1,10,al2,"Узгалар мулк",fb));
            p[9].add(L(0,1,10,al2,"ни т.т килиш",fb));
            p[9].add(L(0,1,10,al2,"б-н боглик",fb));
            p[9].add(L(0,1,10,al2,"булмаган",fb));
            p[9].add(L(0,1,10,al2,"жиноятлар",fb));
            p[9].add(L(1,1,10,al2,"170-174мм",fb));
            p[9].add(L(1,1,10,al2,"7",fb));

            p[10].add(L(1,0,10,al1,"",fb));
            p[10].add(L(0,1,10,al2,"Уз.Р ЖПК",fb));
            p[10].add(L(0,1,10,al2,"нинг",fb));
            p[10].add(L(0,1,10,al2,"182-190",fb));
            p[10].add(L(0,1,10,al2,"моддалар",fb));
            p[10].add(L(0,1,10,al2,"",fb));
            p[10].add(L(1,1,10,al2,"",fb));
            p[10].add(L(1,1,10,al2,"8",fb));

            p[11].add(L(1,0,10,al1,"",fb));
            p[11].add(L(0,1,10,al2,"Бошка",fb));
            p[11].add(L(0,1,10,al2,"жиноят",fb));
            p[11].add(L(0,1,10,al2,"лар",fb));
            p[11].add(L(0,1,10,al2,"",fb));
            p[11].add(L(0,1,10,al2,"",fb));
            p[11].add(L(1,1,10,al2,"",fb));
            p[11].add(L(1,1,10,al2,"9",fb));

            p[12].add(L(1,1,10,al1,"",fb));
            p[12].add(L(0,1,10,al2,"Шу жумла",fb));
            p[12].add(L(0,1,10,al2,"дан терроризм",fb));
            p[12].add(L(0,1,10,al2,"ва жин.фаол",fb));
            p[12].add(L(0,1,10,al2,"олин.даром.",fb));
            p[12].add(L(0,1,10,al2,"легалл",fb));
            p[12].add(L(1,1,10,al2,"(155,243-мм)",fb));
            p[12].add(L(1,1,10,al2,"10",fb));
        }
        if (dbn.equals("t8")) {
            p[1].add(L(0,0,10,al2,"",fb));
            p[1].add(L(0,0,10,al2,"ЖАДВАЛ 6.",fb));
            p[1].add(L(1,0,10,al2,"",fb));
            p[1].add(L(1,0,10,al2,"",fb));

            p[2].add(L(0,1,10,al2,"",fb));
            p[2].add(L(0,1,10,al1,"Жиноят содир этишда гумон килинувчилар-",fb));
            p[2].add(L(1,1,10,al1,"нинг ушлаб турилиши.",fb));
            p[2].add(L(1,1,10,al2,"а",fb));

            p[3].add(L(0,1,10,al2,"",fb));
            p[3].add(L(0,1,10,al2,"",fb));
            p[3].add(L(1,1,10,al2,"",fb));
            p[3].add(L(1,1,10,al2,"б",fb));

            p[4].add(L(1,0,10,al3,"Уш",fb));
            p[4].add(L(0,1,10,al2,"Прок-ра",fb));
            p[4].add(L(1,1,10,al2,"",fb));
            p[4].add(L(1,1,10,al2,"1",fb));

            p[5].add(L(1,0,10,al1,"ланганлар",fb));
            p[5].add(L(0,1,10,al2,"ИИВ",fb));
            p[5].add(L(1,1,10,al2,"",fb));
            p[5].add(L(1,1,10,al2,"2",fb));

            p[6].add(L(1,1,10,al1,"",fb));
            p[6].add(L(0,1,10,al2,"Cуришт",fb));
            p[6].add(L(1,1,10,al2,"органи",fb));
            p[6].add(L(1,1,10,al2,"3",fb));
        }
        if (dbn.equals("t9")) {
            p[1].add(L(0,1,10,al2,"",fb));
            p[1].add(L(0,1,10,al2,"ЖАДВАЛ 7. Вояга етмаганлар ва уларнинг",fb));
            p[1].add(L(0,1,10,al2,"иштирокида содир килинган жиноятлар",fb));
            p[1].add(L(0,1,10,al2,"буйича ишлар (такрорийларсиз)",fb));
            p[1].add(L(1,1,10,al2,"",fb));
            p[1].add(L(1,1,10,al2,"Устунларда 1-11 каторгача 12-катордаги сонга тенг",fb));
            p[1].add(L(1,1,10,al2,"а",fb));
            p[2].add(L(0,1,10,al1,"",fb)); p[2].add(L(0,1,10,al1,"",fb)); p[2].add(L(0,1,10,al1,"",fb)); p[2].add(L(0,1,10,al1,"",fb));
            p[2].add(L(0,1,10,al1,"",fb)); p[2].add(L(1,1,10,al1,"",fb)); p[2].add(L(1,1,10,al2,"б",fb));
            p[3].add(L(0,1,10,al2,"Жами",fb)); p[3].add(L(0,1,10,al2,"судлар",fb)); p[3].add(L(0,1,10,al2,"га юбор",fb));
            p[3].add(L(0,1,10,al2,"илган",fb)); p[3].add(L(0,1,10,al2,"ишлар",fb)); p[3].add(L(1,1,10,al2,"сони",fb));
            p[3].add(L(1,1,10,al2,"1",fb));
            p[4].add(L(0,0,10,al3,"Судга ош",fb)); p[4].add(L(0,0,10,al3,"ишлар б",fb)); p[4].add(L(1,0,10,al3,"чилар",fb));
            p[4].add(L(0,1,10,al2,"",fb));
            p[4].add(L(0,1,10,al2,"Жами",fb)); p[4].add(L(1,1,10,al2,"",fb)); p[4].add(L(1,1,10,al2,"2",fb));
            p[5].add(L(0,1,10,al1,"ирилган",fb)); p[5].add(L(0,1,10,al1,"-ча айб",fb)); p[5].add(L(1,1,10,al1," сони",fb));
            p[5].add(L(0,1,10,al2,"ш.ж. в/е",fb)); p[5].add(L(0,1,10,al2,"сони",fb));
            p[5].add(L(1,1,10,al2,"",fb)); p[5].add(L(1,1,10,al2,"3",fb));
            p[6].add(L(0,1,10,al2,"Жиноят",fb)); p[6].add(L(0,1,10,al2,"содир этга",fb)); p[6].add(L(0,1,10,al2,"вояга етма",fb));
            p[6].add(L(0,1,10,al2,"ган ишл.",fb)); p[6].add(L(0,1,10,al2,"б-ча озод",fb));
            p[6].add(L(1,1,10,al2,"килинди",fb)); p[6].add(L(1,1,10,al2,"4",fb));
        }
        if (dbn.equals("t10")) {
            p[1].add(L(0,0,10,al2,"ЖАДВАЛ 8.",fb)); p[1].add(L(1,0,10,al3,"",fb)); p[1].add(L(1,0,10,al3,"",fb));
            p[2].add(L(0,1,10,al1,"Терговни тухтатиш асослари ЖПКнинг ",fb));
            p[2].add(L(1,1,10,al1,"364 моддаси (такрорийларсиз)",fb));
            p[2].add(L(1,1,10,al2,"а",fb));
            p[3].add(L(0,1,10,al1,"",fb)); p[3].add(L(1,1,10,al1,"",fb)); p[3].add(L(1,1,10,al2,"б",fb));
            p[4].add(L(0,1,10,al2,"Прок-ра",fb)); p[4].add(L(1,1,10,al2,"",fb)); p[4].add(L(1,1,10,al2,"1",fb));
            p[5].add(L(0,1,10,al2,"ИИВ",fb)); p[5].add(L(1,1,10,al2,"",fb)); p[5].add(L(1,1,10,al2,"2",fb));
        }
        if (dbn.equals("t2")) {
            p[1].add(L(0,0,10,al3,"13+38+40+42+49",fb));
            p[1].add(L(0,0,10,al3,"14+39+41+43+50",fb));
            p[1].add(L(1,0,10,al3,"19+21+23+25+26",fb));
            p[1].add(L(1,0,10,al2,"",fb));

            p[2].add(L(0,1,10,al1," каторларнинг суммаси 1+3 каторлар суммасига тенг;",fb));
            p[2].add(L(0,1,10,al1," каторларнинг суммаси 2+4 каторлар суммасига тенг;",fb));
            p[2].add(L(1,1,10,al1," каторларнинг суммаси 13 каторга тенг",fb));
            p[2].add(L(1,1,10,al2,"a",fb));

            p[3].add(L(0,1,10,al2,"",fb));
            p[3].add(L(0,1,10,al2,"",fb));
            p[3].add(L(1,1,10,al2,"",fb));
            p[3].add(L(1,1,10,al2,"б",fb));

            p[4].add(L(0,1,10,al2,"Проку-",fb));
            p[4].add(L(0,1,10,al2,"ратура",fb));
            p[4].add(L(1,1,10,al2,"",fb));
            p[4].add(L(1,1,10,al2,"1",fb));

            p[5].add(L(0,1,10,al2,"",fb));
            p[5].add(L(0,1,10,al2,"ИИВ",fb));
            p[5].add(L(1,1,10,al2,"",fb));
            p[5].add(L(1,1,10,al2,"2",fb));
        }
        if (dbn.equals("t3")) {
            p[1].add(L(0,0,10,al2,"",fb));
            p[1].add(L(0,0,10,al2,"",fb));
            p[1].add(L(0,0,10,al2,"",fb));
            p[1].add(L(1,0,10,al2,"",fb));
            p[1].add(L(1,0,10,al2,"",fb));

            p[2].add(L(0,0,10,al2,"",fb));
            p[2].add(L(0,0,10,al3,"ЖАДВАЛ 1. ТАМОМ",fb));
            p[2].add(L(0,0,10,al3,"ТЕРГОВ МУДДАТЛА",fb));
            p[2].add(L(1,0,10,al2,"",fb));
            p[2].add(L(1,0,10,al2,"",fb));

            p[3].add(L(0,1,10,al2,"",fb));
            p[3].add(L(0,1,10,al1,"ЛАНГАН ИШЛАР БУЙИЧА",fb));
            p[3].add(L(0,1,10,al1,"РИ  (такрорийларсиз)",fb));
            p[3].add(L(1,1,10,al2,"",fb));
            p[3].add(L(1,1,10,al1,"a",fb));

            p[4].add(L(0,1,10,al2,"",fb));
            p[4].add(L(0,1,10,al2,"",fb));
            p[4].add(L(0,1,10,al2,"",fb));
            p[4].add(L(1,1,10,al2,"",fb));
            p[4].add(L(1,1,10,al2,"б",fb));

            p[5].add(L(0,1,10,al2,"",fb));
            p[5].add(L(0,1,10,al2,"Прокура-",fb));
            p[5].add(L(0,1,10,al2,"тура",fb));
            p[5].add(L(1,1,10,al2,"",fb));
            p[5].add(L(1,1,10,al2,"1",fb));

            p[6].add(L(0,1,10,al2,"",fb));
            p[6].add(L(0,1,10,al2,"ИИВ",fb));
            p[6].add(L(0,1,10,al2,"",fb));
            p[6].add(L(1,1,10,al2,"",fb));
            p[6].add(L(1,1,10,al2,"2",fb));
        }
        if (dbn.equals("t11")) {
            p[1].add(L(1,1,10,al2,"Жадвал 9. Жиноятларни олдини олиш чоралари",fb));
            p[1].add(L(1,1,10,al2,"а",fb));
            p[2].add(L(1,1,10,al2,"",fb));
            p[2].add(L(1,1,10,al2,"б",fb));
            p[3].add(L(1,1,10,al2,"Прок-ра",fb));
            p[3].add(L(1,1,10,al2,"1",fb));
            p[4].add(L(1,1,10,al2,"ИИВ",fb));
            p[4].add(L(1,1,10,al2,"2",fb));
        }
        if (dbn.equals("t12")) {
            p[1].add(L(0,0,10,al2,"",fb)); p[1].add(L(1,0,10,al3,"(жами ",fb)); p[1].add(L(1,0,10,al3,"",fb));
            p[2].add(L(0,1,10,al1,"ЖАДВАЛ 10.   Эхтиет чораларини кулланилиши",fb));
            p[2].add(L(1,1,10,al1,"тергов килинган жиноий ишлар буйича такрорийларсиз)",fb));
            p[2].add(L(1,1,10,al2,"а",fb));
            p[3].add(L(0,1,10,al1,"",fb)); p[3].add(L(1,1,10,al1,"",fb)); p[3].add(L(1,1,10,al2,"б",fb));
            p[4].add(L(0,1,10,al2,"Прокуратура",fb)); p[4].add(L(1,1,10,al2,"",fb)); p[4].add(L(1,1,10,al2,"1",fb));
            p[5].add(L(0,1,10,al2,"ИИВ",fb)); p[5].add(L(1,1,10,al2,"",fb)); p[5].add(L(1,1,10,al2,"2",fb));
            p[6].add(L(0,1,10,al2,"1-2 устунлардан вояга",fb)); p[6].add(L(1,1,10,al2,"етмаганларга нисбатан",fb));
            p[6].add(L(1,1,10,al2,"3",fb));
        }
        if (dbn.equals("tx10")) {
            p[1].add(L(0,1,12,al2,"10 - сонли"));
            p[1].add(L(0,1,12,al2,"Ж А Д В А Л"));
            if (sw.length>1) p[1].add(L(1,1,12,al2,sw[2]+" йил "+k+" ойлик")); else p[1].add(L(1,1,12,al2,""));

            p[2].add(L(1,0,12,al2,""));
            p[2].add(L(0,1,12,al2,"тамом."));
            p[2].add(L(1,1,12,al2,"ж.и. сони"));

            p[3].add(L(1,0,12,al2,"Прокуратура"));
            p[3].add(L(0,1,12,al2,"терг. сони"));
            p[3].add(L(1,1,12,al2,"(штат)"));

            p[4].add(L(1,0,12,al2," терговчилари"));
            p[4].add(L(1,0,12,al3,"Иш"));
            p[4].add(L(1,1,12,al2,"Йил бошидан"));

            p[5].add(L(1,1,12,al1,""));
            p[5].add(L(1,1,12,al1," хажми"));
            p[5].add(L(1,1,12,al2,"уртача 1 ойда"));

            p[6].add(L(1,0,12,al2,""));
            p[6].add(L(0,1,12,al2,"тамом."));
            p[6].add(L(1,1,12,al2,"ж.и. сони"));

            p[7].add(L(1,0,12,al3,"ИИВ"));
            p[7].add(L(0,1,12,al2,"терг. сони"));
            p[7].add(L(1,1,12,al2,"(штат)"));

            p[8].add(L(1,0,12,al2," терговчилари"));
            p[8].add(L(1,0,12,al3,"Иш"));
            p[8].add(L(1,1,12,al2,"Йил бошидан"));

            p[9].add(L(1,1,12,al1,""));
            p[9].add(L(1,1,12,al1," хажми"));
            p[9].add(L(1,1,12,al2,"уртача 1 ойда"));
        }
        if (dbn.equals("tx9")) {
            p[1].add(L(0,1,12,al2,"9 - сонли"));
            p[1].add(L(0,1,12,al2,"Ж А Д В А Л"));
            if (sw.length>1) p[1].add(L(1,1,12,al2,sw[2]+" йил "+k+" ойлик")); else p[1].add(L(1,1,12,al2,""));

            p[2].add(L(1,0,12,al3,"Харак"));
            p[2].add(L(1,0,12,al3,"Жа"));
            p[2].add(L(1,1,12,al2,"Прокур."));

            p[3].add(L(1,0,12,al1,"атдан туга"));
            p[3].add(L(1,1,12,al1,"ми"));
            p[3].add(L(1,1,12,al2,"ИИВ"));

            p[4].add(L(1,0,12,al1,"тилган"));
            p[4].add(L(1,0,12,al3,"ЖПК"));
            p[4].add(L(1,1,12,al2,"Прокур."));

            p[5].add(L(1,0,12,al1,"жиноят иш"));
            p[5].add(L(1,1,12,al1," 83м."));
            p[5].add(L(1,1,12,al2,"ИИВ"));

            p[6].add(L(1,0,12,al1,"лар сони"));
            p[6].add(L(1,0,12,al3,"ЖПК"));
            p[6].add(L(1,1,12,al2,"Прокур."));

            p[7].add(L(1,1,12,al1,""));
            p[7].add(L(1,1,12,al1," 84м."));
            p[7].add(L(1,1,12,al2,"ИИВ"));

            p[8].add(L(0,0,12,al3,"Такр"));
            p[8].add(L(1,0,12,al3,"тугат"));
            p[8].add(L(1,1,12,al2,"Прокур."));

            p[9].add(L(0,1,12,al1,"оран"));
            p[9].add(L(1,1,12,al1,"илган"));
            p[9].add(L(1,1,12,al2,"ИИВ"));

            p[10].add(L(0,0,12,al2,"Кушимча"));
            p[10].add(L(1,0,12,al2,"кайт-дан"));
            p[10].add(L(1,1,12,al2,"Прокур."));

            p[11].add(L(0,1,12,al2,"терг"));
            p[11].add(L(1,1,12,al2,"туг-н"));
            p[11].add(L(1,1,12,al2,"ИИВ"));

            p[12].add(L(0,0,12,al3,"Амн-я кул"));
            p[12].add(L(1,0,12,al3,"судга юб"));
            p[12].add(L(1,1,12,al2,"Прокур."));

            p[13].add(L(0,1,12,al1,"лаш у-н"));
            p[13].add(L(1,1,12,al1,"ор.илтим."));
            p[13].add(L(1,1,12,al2,"ИИВ"));
        }
        if (dbn.equals("tx8")) {
            p[1].add(L(0,1,12,al2,"8 - сонли"));
            p[1].add(L(0,1,12,al2,"Ж А Д В А Л"));
            if (sw.length>1) p[1].add(L(0,1,12,al2,sw[2]+" йил "+k+" ойлик")); else p[1].add(L(0,1,12,al2,""));
            p[1].add(L(1,1,12,al2,""));

            p[2].add(L(0,0,12,al2,"Тегишли"));
            p[2].add(L(1,0,12,al3,"юборилга"));
            p[2].add(L(1,0,12,al3,"Тергов"));
            p[2].add(L(1,1,12,al2,"Прокур."));

            p[3].add(L(0,0,12,al2,"тергов"));
            p[3].add(L(1,0,12,al1,"н ишлар"));
            p[3].add(L(1,1,12,al1,"чилар"));
            p[3].add(L(1,1,12,al2,"ИИВ"));

            p[4].add(L(0,1,12,al2,"идораларга"));
            p[4].add(L(1,1,12,al2,"сони"));
            p[4].add(L(0,1,12,al2,"Ш.ж."));
            p[4].add(L(1,1,12,al2,"в.етмаг."));

            p[5].add(L(0,0,12,al2,"Бошка"));
            p[5].add(L(1,0,12,al3,"кушилг"));
            p[5].add(L(1,0,12,al3,"Тергов"));
            p[5].add(L(1,1,12,al2,"Прокур."));

            p[6].add(L(0,0,12,al2,"Жиноят"));
            p[6].add(L(1,0,12,al1,"ан ишлар"));
            p[6].add(L(1,1,12,al1,"чилар"));
            p[6].add(L(1,1,12,al2,"ИИВ"));

            p[7].add(L(0,1,12,al2,"ишларга"));
            p[7].add(L(1,1,12,al2,"сони"));
            p[7].add(L(0,1,12,al2,"Ш.ж."));
            p[7].add(L(1,1,12,al2,"в.етмаг."));

            p[8].add(L(0,0,12,al3,"Ойни охи"));
            p[8].add(L(1,0,12,al3,"ган жин"));
            p[8].add(L(1,0,12,al3,"Тергов"));
            p[8].add(L(1,1,12,al2,"Прокур."));

            p[9].add(L(0,0,12,al1,"рига тугати"));
            p[9].add(L(1,0,12,al1,"оий ишлар"));
            p[9].add(L(1,1,12,al1,"чилар"));
            p[9].add(L(1,1,12,al2,"ИИВ"));

            p[10].add(L(0,1,12,al1,"лмай кол"));
            p[10].add(L(1,1,12,al1,"сони"));
            p[10].add(L(0,1,12,al2,"Ш.ж."));
            p[10].add(L(1,1,12,al2,"в.етмаг."));
        }
        if (dbn.equals("tx7")) {
            p[1].add(L(0,1,12,al2,""));
            p[1].add(L(0,1,12,al2,"7 - сонли"));
            p[1].add(L(0,1,12,al2,"Ж А Д В А Л"));
            if (sw.length>1) p[1].add(L(0,1,12,al2,sw[2]+" йил "+k+" ойлик")); else p[1].add(L(0,1,12,al2,""));
            p[1].add(L(0,1,12,al2,""));
            p[1].add(L(1,1,12,al2,""));

            p[2].add(L(0,0,12,al3,"Жиноят"));
            p[2].add(L(1,0,12,al3,"турилган"));
            p[2].add(L(0,0,12,al3,"Жиноят"));
            p[2].add(L(1,0,12,al3,"гумони"));
            p[2].add(L(1,0,12,al3,"Тергов"));
            p[2].add(L(1,1,12,al2,"Прокур."));

            p[3].add(L(0,0,12,al2,"содир"));
            p[3].add(L(1,0,12,al1,"лардан"));
            p[3].add(L(0,0,12,al2,"содир"));
            p[3].add(L(1,0,12,al3,"тасдикла"));
            p[3].add(L(1,1,12,al1,"чилар"));
            p[3].add(L(1,1,12,al2,"ИИВ"));

            p[4].add(L(0,0,12,al2,"килишда"));
            p[4].add(L(1,0,12,al1,"озод  кил"));
            p[4].add(L(0,1,12,al1,"этганлик"));
            p[4].add(L(1,1,12,al1,"нмаган"));
            p[4].add(L(0,1,12,al2,"Ш.ж."));
            p[4].add(L(1,1,12,al2,"в.етмаг."));

            p[5].add(L(0,0,12,al2,"гумон"));
            p[5].add(L(1,0,12,al1,"инган"));
            p[5].add(L(0,0,12,al3,"Камокка"));
            p[5].add(L(1,0,12,al3,"йук"));
            p[5].add(L(1,0,12,al3,"Тергов"));
            p[5].add(L(1,1,12,al2,"Прокур."));

            p[6].add(L(0,0,12,al2,"килиниб"));
            p[6].add(L(1,0,12,al2,"шахслар"));
            p[6].add(L(0,0,12,al2,"олишга"));
            p[6].add(L(1,0,12,al1,"лиги  саба"));
            p[6].add(L(1,1,12,al1,"чилар"));
            p[6].add(L(1,1,12,al2,"ИИВ"));

            p[7].add(L(0,1,12,al2,"ушлаб"));
            p[7].add(L(1,1,12,al2,""));
            p[7].add(L(0,1,12,al3,"зарурият"));
            p[7].add(L(1,1,12,al1,"бли"));
            p[7].add(L(0,1,12,al2,"Ш.ж."));
            p[7].add(L(1,1,12,al2,"в.етмаг."));

            p[8].add(L(0,0,12,al2,""));
            p[8].add(L(0,0,12,al3,"Гаров"));
            p[8].add(L(0,0,12,al3,"кулла"));
            p[8].add(L(1,0,12,al2,""));
            p[8].add(L(1,0,12,al3,"Тергов"));
            p[8].add(L(1,1,12,al2,"Прокур."));

            p[9].add(L(0,0,12,al2,""));
            p[9].add(L(0,0,12,al2,"эхтиет"));
            p[9].add(L(0,0,12,al1,"нилган ша"));
            p[9].add(L(1,0,12,al2,""));
            p[9].add(L(1,1,12,al1,"чилар"));
            p[9].add(L(1,1,12,al2,"ИИВ"));

            p[10].add(L(0,1,12,al2,""));
            p[10].add(L(0,1,12,al1,"чораси"));
            p[10].add(L(0,1,12,al1,"хслар"));
            p[10].add(L(1,1,12,al2,""));
            p[10].add(L(0,1,12,al2,"Ш.ж."));
            p[10].add(L(1,1,12,al2,"в.етмаг."));
        }
        if (dbn.equals("tx6")) {
            p[1].add(L(0,1,12,al2,"6 - сонли"));
            p[1].add(L(0,1,12,al2,"Ж А Д В А Л"));
            if (sw.length>1) p[1].add(L(0,1,12,al2,sw[2]+" йил "+k+" ойлик")); else p[1].add(L(0,1,12,al2,""));
            p[1].add(L(1,1,12,al2,""));

            p[2].add(L(0,0,12,al3,"Харакат"));
            p[2].add(L(1,0,12,al3,""));
            p[2].add(L(1,0,12,al3,""));
            p[2].add(L(1,1,12,al2,"Жами"));

            p[3].add(L(0,0,12,al1,"дан  тухта"));
            p[3].add(L(1,0,12,al3,""));
            p[3].add(L(1,0,12,al3,"Прокура"));
            p[3].add(L(1,1,12,al2,"364м 1б"));

            p[4].add(L(0,0,12,al1,"тилган"));
            p[4].add(L(1,0,12,al3,""));
            p[4].add(L(1,1,12,al1,"тура"));
            p[4].add(L(1,1,12,al2,"364м 2б"));

            p[5].add(L(0,0,12,al1,"жиноий"));
            p[5].add(L(1,0,12,al3,""));
            p[5].add(L(1,0,12,al3,""));
            p[5].add(L(1,1,12,al2,"Жами"));

            p[6].add(L(0,0,12,al1,"ишлар"));
            p[6].add(L(1,0,12,al3,""));
            p[6].add(L(1,0,12,al2,"ИИВ"));
            p[6].add(L(1,1,12,al2,"364м 1б"));

            p[7].add(L(0,1,12,al1,"сони"));
            p[7].add(L(1,1,12,al3,""));
            p[7].add(L(1,1,12,al1,""));
            p[7].add(L(1,1,12,al2,"364м 2б"));

            p[8].add(L(0,0,12,al3,"Ж-т содир"));
            p[8].add(L(1,0,12,al2,"ушлаб"));
            p[8].add(L(1,0,12,al3,"Тергов"));
            p[8].add(L(1,1,12,al2,"Прокур."));

            p[9].add(L(0,0,12,al2,"кил-да"));
            p[9].add(L(1,0,12,al3,"турил.шах"));
            p[9].add(L(1,1,12,al1,"чилар"));
            p[9].add(L(1,1,12,al2,"ИИВ"));

            p[10].add(L(0,1,12,al2,"гумонл."));
            p[10].add(L(1,1,12,al1,"слар сони"));
            p[10].add(L(0,1,12,al2,"Вояга"));
            p[10].add(L(1,1,12,al2,"етмаган."));

            p[11].add(L(0,0,12,al3,"Шунд"));
            p[11].add(L(1,0,12,al3,"олинган"));
            p[11].add(L(1,0,12,al3,"Тергов"));
            p[11].add(L(1,1,12,al2,"Прокур."));

            p[12].add(L(0,0,12,al1,"ан камок"));
            p[12].add(L(1,0,12,al2,"шахслар"));
            p[12].add(L(1,1,12,al1,"чилар"));
            p[12].add(L(1,1,12,al2,"ИИВ"));

            p[13].add(L(0,1,12,al1,"ка"));
            p[13].add(L(1,1,12,al1,"сони"));
            p[13].add(L(0,1,12,al2,"Вояга"));
            p[13].add(L(1,1,12,al2,"етмаган."));
        }
        if (dbn.equals("tx5")) {
            p[1].add(L(0,1,12,al2,""));
            p[1].add(L(0,1,12,al2,"5 - сонли"));
            p[1].add(L(0,1,12,al2,"Ж А Д В А Л"));
            if (sw.length>1) p[1].add(L(0,1,12,al2,sw[2]+" йил "+k+" ойлик")); else p[1].add(L(0,1,12,al2,""));
            p[1].add(L(1,1,12,al2,""));

            p[2].add(L(1,0,12,al3,""));
            p[2].add(L(1,0,12,al3,""));
            p[2].add(L(0,0,12,al3,"и"));
            p[2].add(L(1,0,12,al3,"етки"));
            if (sw.length>1) {int m=l-1; p[2].add(L(1,1,12,al2,""+m));} else p[2].add(L(1,1,12,al2,""));

            p[3].add(L(1,0,12,al3,""));
            p[3].add(L(1,0,12,al3,"Прокура"));
            p[3].add(L(0,1,12,al1,"ши"));
            p[3].add(L(1,1,12,al1,"зилган"));
            if (sw.length>1) p[3].add(L(1,1,12,al2,""+l)); else p[3].add(L(1,1,12,al2,""));

            p[4].add(L(1,0,12,al3,""));
            p[4].add(L(1,0,12,al1,"тура терг"));
            p[4].add(L(0,0,12,al3,"камо"));
            p[4].add(L(1,0,12,al3,"сакла"));
            if (sw.length>1) {int m=l-1; p[4].add(L(1,1,12,al2,""+m));} else p[4].add(L(1,1,12,al2,""));

            p[5].add(L(1,0,12,al3,""));
            p[5].add(L(1,0,12,al1,"овчилари"));
            p[5].add(L(0,1,12,al1,"кда"));
            p[5].add(L(1,1,12,al1,"нган"));
            if (sw.length>1) p[5].add(L(1,1,12,al2,""+l)); else p[5].add(L(1,1,12,al2,""));

            p[6].add(L(1,0,12,al3,"Нокону"));
            p[6].add(L(1,0,12,al3,""));
            p[6].add(L(0,0,12,al3,"суд том"));
            p[6].add(L(1,0,12,al3,"окла"));
            if (sw.length>1) {int m=l-1; p[6].add(L(1,1,12,al2,""+m));} else p[6].add(L(1,1,12,al2,""));

            p[7].add(L(1,0,12,al1,"ний жино"));
            p[7].add(L(1,0,12,al3,""));
            p[7].add(L(0,1,12,al1,"онидан"));
            p[7].add(L(1,1,12,al1,"нган"));
            if (sw.length>1) p[7].add(L(1,1,12,al2,""+l)); else p[7].add(L(1,1,12,al2,""));

            p[8].add(L(1,0,12,al1,"ий жавоб"));
            p[8].add(L(1,0,12,al1,""));
            p[8].add(L(0,0,12,al3,"камо"));
            p[8].add(L(1,0,12,al3,"сакла"));
            if (sw.length>1) {int m=l-1; p[8].add(L(1,1,12,al2,""+m));} else p[8].add(L(1,1,12,al2,""));

            p[9].add(L(1,0,12,al1,"гарликка"));
            p[9].add(L(1,1,12,al1,""));
            p[9].add(L(0,1,12,al1,"кда"));
            p[9].add(L(1,1,12,al1,"нган"));
            if (sw.length>1) p[9].add(L(1,1,12,al2,""+l)); else p[9].add(L(1,1,12,al2,""));

            p[10].add(L(1,0,12,al3,"тортилг"));
            p[10].add(L(1,0,12,al3,""));
            p[10].add(L(0,0,12,al3,"и"));
            p[10].add(L(1,0,12,al3,"етки"));
            if (sw.length>1) {int m=l-1; p[10].add(L(1,1,12,al2,""+m));} else p[10].add(L(1,1,12,al2,""));

            p[11].add(L(1,0,12,al1,"ан  шахс"));
            p[11].add(L(1,0,12,al3,""));
            p[11].add(L(0,1,12,al1,"ши"));
            p[11].add(L(1,1,12,al1,"зилган"));
            if (sw.length>1) p[11].add(L(1,1,12,al2,""+l)); else p[11].add(L(1,1,12,al2,""));

            p[12].add(L(1,0,12,al1,"лар сони"));
            p[12].add(L(1,0,12,al1,"ИИВ терг"));
            p[12].add(L(0,0,12,al3,"камо"));
            p[12].add(L(1,0,12,al3,"сакла"));
            if (sw.length>1) {int m=l-1; p[12].add(L(1,1,12,al2,""+m));} else p[12].add(L(1,1,12,al2,""));

            p[13].add(L(1,0,12,al3,""));
            p[13].add(L(1,0,12,al1,"овчилари"));
            p[13].add(L(0,1,12,al1,"кда"));
            p[13].add(L(1,1,12,al1,"нган"));
            if (sw.length>1) p[13].add(L(1,1,12,al2,""+l)); else p[13].add(L(1,1,12,al2,""));

            p[14].add(L(1,0,12,al3,""));
            p[14].add(L(1,0,12,al3,""));
            p[14].add(L(0,0,12,al3,"суд том"));
            p[14].add(L(1,0,12,al3,"окла"));
            if (sw.length>1) {int m=l-1; p[14].add(L(1,1,12,al2,""+m));} else p[14].add(L(1,1,12,al2,""));

            p[15].add(L(1,0,12,al3,""));
            p[15].add(L(1,0,12,al3,""));
            p[15].add(L(0,1,12,al1,"онидан"));
            p[15].add(L(1,1,12,al1,"нган"));
            if (sw.length>1) p[15].add(L(1,1,12,al2,""+l)); else p[15].add(L(1,1,12,al2,""));

            p[16].add(L(1,0,12,al3,""));
            p[16].add(L(1,0,12,al1,""));
            p[16].add(L(0,0,12,al3,"камо"));
            p[16].add(L(1,0,12,al3,"сакла"));
            if (sw.length>1) {int m=l-1; p[16].add(L(1,1,12,al2,""+m));} else p[16].add(L(1,1,12,al2,""));

            p[17].add(L(1,1,12,al3,""));
            p[17].add(L(1,1,12,al1,""));
            p[17].add(L(0,1,12,al1,"кда"));
            p[17].add(L(1,1,12,al1,"нган"));
            if (sw.length>1) p[17].add(L(1,1,12,al2,""+l)); else p[17].add(L(1,1,12,al2,""));
        }
        if (dbn.equals("tx4")) {
            p[1].add(L(0,1,12,al2,"4 - сонли"));
            p[1].add(L(0,1,12,al2,"Ж А Д В А Л"));
            if (sw.length>1) p[1].add(L(0,1,12,al2,sw[2]+" йил "+k+" ойлик")); else p[1].add(L(0,1,12,al2,""));
            p[1].add(L(1,1,12,al2,""));

            p[2].add(L(1,0,12,al3,""));
            p[2].add(L(1,0,12,al3,"Прокурор"));
            p[2].add(L(1,0,12,al2,"Прокур."));
            if (sw.length>1) {int m=l-1; p[2].add(L(1,1,12,al2,""+m));} else p[2].add(L(1,1,12,al2,""));

            p[3].add(L(1,0,12,al1,""));
            p[3].add(L(1,0,12,al3,"томони"));
            p[3].add(L(1,1,12,al2,"тергов."));
            if (sw.length>1) p[3].add(L(1,1,12,al2,""+l)); else p[3].add(L(1,1,12,al2,""));

            p[4].add(L(1,0,12,al3,""));
            p[4].add(L(1,0,12,al1,"дан кайт"));
            p[4].add(L(1,0,12,al2,"ИИВ"));
            if (sw.length>1) {int m=l-1; p[4].add(L(1,1,12,al2,""+m));} else p[4].add(L(1,1,12,al2,""));

            p[5].add(L(1,0,12,al1,"Кушимча"));
            p[5].add(L(1,1,12,al1,"арилган"));
            p[5].add(L(1,1,12,al2,"тергов."));
            if (sw.length>1) p[5].add(L(1,1,12,al2,""+l)); else p[5].add(L(1,1,12,al2,""));

            p[6].add(L(1,0,12,al1,"терговга"));
            p[6].add(L(1,0,12,al2,""));
            p[6].add(L(1,0,12,al3,"Прокура"));
            if (sw.length>1) {int m=l-1; p[6].add(L(1,1,12,al2,""+m));} else p[6].add(L(1,1,12,al2,""));

            p[7].add(L(1,0,12,al2,"кайтган"));
            p[7].add(L(1,0,12,al3,""));
            p[7].add(L(1,0,12,al2,"тура терго"));
            p[7].add(L(1,1,12,al2,"%"));

            p[8].add(L(1,0,12,al1,"ишлар"));
            p[8].add(L(1,0,12,al3,"Суд то"));
            p[8].add(L(1,0,12,al1,"вчилари"));
            if (sw.length>1) p[8].add(L(1,1,12,al2,""+l)); else p[8].add(L(1,1,12,al2,""));

            p[9].add(L(1,0,12,al1,""));
            p[9].add(L(1,0,12,al1,"монидан"));
            p[9].add(L(1,1,12,al2,""));
            p[9].add(L(1,1,12,al2,"%"));

            p[10].add(L(1,0,12,al1,""));
            p[10].add(L(1,0,12,al3,"кайтарил"));
            p[10].add(L(1,0,12,al3,"ИИВ"));
            if (sw.length>1) {int m=l-1; p[10].add(L(1,1,12,al2,""+m));} else p[10].add(L(1,1,12,al2,""));

            p[11].add(L(1,0,12,al1,""));
            p[11].add(L(1,0,12,al1,"ган"));
            p[11].add(L(1,0,12,al3,"терговчи"));
            p[11].add(L(1,1,12,al2,"%"));

            p[12].add(L(1,0,12,al2,""));
            p[12].add(L(1,0,12,al2,""));
            p[12].add(L(1,0,12,al1,"лари"));
            if (sw.length>1) p[12].add(L(1,1,12,al2,""+l)); else p[12].add(L(1,1,12,al2,""));

            p[13].add(L(1,1,12,al2,""));
            p[13].add(L(1,1,12,al2,""));
            p[13].add(L(1,1,12,al1,""));
            p[13].add(L(1,1,12,al2,"%"));
        }
        if (dbn.equals("tx3")) {
            p[1].add(L(0,1,12,al2,"3 - сонли"));
            p[1].add(L(0,1,12,al2,"Ж А Д В А Л"));
            if (sw.length>1) p[1].add(L(0,1,12,al2,sw[2]+" йил "+k+" ойлик")); else p[1].add(L(0,1,12,al2,""));
            p[1].add(L(1,1,12,al2,""));

            p[2].add(L(0,0,12,al3,"Конунда"));
            p[2].add(L(1,0,12,al3,""));
            p[2].add(L(1,0,12,al3,"Прокура"));
            if (sw.length>1) {int m=l-1; p[2].add(L(1,1,12,al2,""+m));} else p[2].add(L(1,1,12,al2,""));

            p[3].add(L(0,0,12,al3," курсатилг"));
            p[3].add(L(1,0,12,al3,""));
            p[3].add(L(1,0,12,al2,"тура терго"));
            p[3].add(L(1,1,12,al2,"%"));

            p[4].add(L(0,0,12,al1,"анидан ор"));
            p[4].add(L(1,0,12,al1,""));
            p[4].add(L(1,0,12,al1,"вчилари"));
            if (sw.length>1) p[4].add(L(1,1,12,al2,""+l)); else p[4].add(L(1,1,12,al2,""));

            p[5].add(L(0,0,12,al1,"тик мудд"));
            p[5].add(L(1,0,12,al1,""));
            p[5].add(L(1,1,12,al2,""));
            p[5].add(L(1,1,12,al2,"%"));

            p[6].add(L(0,0,12,al1,"атда туг"));
            p[6].add(L(1,0,12,al1,""));
            p[6].add(L(1,0,12,al3,"ИИВ"));
            if (sw.length>1) {int m=l-1; p[6].add(L(1,1,12,al2,""+m));} else p[6].add(L(1,1,12,al2,""));

            p[7].add(L(0,0,12,al1,"алланган"));
            p[7].add(L(1,0,12,al1,""));
            p[7].add(L(1,0,12,al3,"терговчи"));
            p[7].add(L(1,1,12,al2,"%"));

            p[8].add(L(0,0,12,al2,"ишлар"));
            p[8].add(L(1,0,12,al2,""));
            p[8].add(L(1,0,12,al1,"лари"));
            if (sw.length>1) p[8].add(L(1,1,12,al2,""+l)); else p[8].add(L(1,1,12,al2,""));

            p[9].add(L(0,1,12,al1,"сони"));
            p[9].add(L(1,1,12,al1,""));
            p[9].add(L(1,1,12,al3,""));
            p[9].add(L(1,1,12,al2,"%"));

            p[10].add(L(0,0,12,al3,"Судга   "));
            p[10].add(L(0,0,12,al2,"буйича"));
            p[10].add(L(1,0,12,al3,"шахс"));
            p[10].add(L(1,1,12,al2,"прокур."));

            p[11].add(L(0,0,12,al3,"юборилган"));
            p[11].add(L(0,0,12,al1,"судга  бери"));
            p[11].add(L(1,0,12,al1,"лар сони"));
            p[11].add(L(1,1,12,al2,"ИИВ"));

            p[12].add(L(0,1,12,al2,"ишлар"));
            p[12].add(L(0,1,12,al1,"лган"));
            p[12].add(L(1,1,12,al1,""));
            p[12].add(L(1,1,12,al2,"в.етм."));
        }
        if (dbn.equals("tx2")) {
            p[1].add(L(0,1,12,al2,""));
            p[1].add(L(0,1,12,al2,"2 - сонли"));
            p[1].add(L(0,1,12,al2,"Ж А Д В А Л"));
            if (sw.length>1) p[1].add(L(0,1,12,al2,sw[2]+" йил "+k+" ойлик")); else p[1].add(L(0,1,12,al2,""));
            p[1].add(L(1,1,12,al2,""));

            p[2].add(L(0,0,12,al3,"Айблаш"));
            p[2].add(L(0,0,12,al3,"характе"));
            p[2].add(L(1,0,12,al2,""));
            p[2].add(L(1,0,12,al3,"Прокура"));
            if (sw.length>1) {int m=l-1; p[2].add(L(1,1,12,al2,""+m));} else p[2].add(L(1,1,12,al2,""));

            p[3].add(L(0,0,12,al2," фикри, яр"));
            p[3].add(L(0,0,12,al1,"рда  кулла"));
            p[3].add(L(1,0,12,al3,"юборил"));
            p[3].add(L(1,0,12,al2,"тура терго"));
            if (sw.length>1) p[3].add(L(1,1,12,al2,""+l)); else p[3].add(L(1,1,12,al2,""));

            p[4].add(L(0,0,12,al1,"ашув,амни"));
            p[4].add(L(0,0,12,al1,"нилган  тур"));
            p[4].add(L(1,0,12,al1,"ган ишлар"));
            p[4].add(L(1,1,12,al1,"вчилари"));
            p[4].add(L(1,1,12,al2,"%"));

            p[5].add(L(0,0,12,al1,"стия еки"));
            p[5].add(L(0,0,12,al2,"даги каро"));
            p[5].add(L(1,0,12,al1," сони"));
            p[5].add(L(1,0,12,al2,"ИИВ"));
            if (sw.length>1) {int m=l-1; p[5].add(L(1,1,12,al2,""+m));} else p[5].add(L(1,1,12,al2,""));

            p[6].add(L(0,0,12,al1,"мажбурий"));
            p[6].add(L(0,0,12,al1,"р билан"));
            p[6].add(L(1,0,12,al1,""));
            p[6].add(L(1,0,12,al3,"терговчи"));
            if (sw.length>1) p[6].add(L(1,1,12,al2,""+l)); else p[6].add(L(1,1,12,al2,""));

            p[7].add(L(0,1,12,al1," тиббий"));
            p[7].add(L(0,1,12,al1," прокурорга"));
            p[7].add(L(1,1,12,al2,""));
            p[7].add(L(1,1,12,al1,"лари"));
            p[7].add(L(1,1,12,al2,"%"));

            p[8].add(L(0,0,12,al2,""));
            p[8].add(L(0,0,12,al2,""));
            p[8].add(L(1,0,12,al2,""));
            p[8].add(L(1,0,12,al3,"Прокура"));
            if (sw.length>1) {int m=l-1; p[8].add(L(1,1,12,al2,""+m));} else p[8].add(L(1,1,12,al2,""));

            p[9].add(L(0,0,12,al3,""));
            p[9].add(L(0,0,12,al3,""));
            p[9].add(L(1,0,12,al3,""));
            p[9].add(L(1,0,12,al2,"тура терго"));
            p[9].add(L(1,1,12,al2,"%"));

            p[10].add(L(0,0,12,al1,""));
            p[10].add(L(0,0,12,al3,"Тугатил"));
            p[10].add(L(1,0,12,al1,""));
            p[10].add(L(1,0,12,al1,"вчилари"));
            if (sw.length>1) p[10].add(L(1,1,12,al2,""+l)); else p[10].add(L(1,1,12,al2,""));

            p[11].add(L(0,0,12,al3,""));
            p[11].add(L(0,0,12,al1,"ган ишлар"));
            p[11].add(L(1,0,12,al3,""));
            p[11].add(L(1,1,12,al2,""));
            p[11].add(L(1,1,12,al2,"%"));

            p[12].add(L(0,0,12,al2,""));
            p[12].add(L(0,0,12,al1," сони"));
            p[12].add(L(1,0,12,al2,""));
            p[12].add(L(1,0,12,al2,"ИИВ"));
            if (sw.length>1) {int m=l-1; p[12].add(L(1,1,12,al2,""+m));} else p[12].add(L(1,1,12,al2,""));

            p[13].add(L(0,0,12,al1,""));
            p[13].add(L(0,0,12,al1,""));
            p[13].add(L(1,0,12,al1,""));
            p[13].add(L(1,0,12,al3,"терговчи"));
            p[13].add(L(1,1,12,al2,"%"));

            p[14].add(L(0,0,12,al2,""));
            p[14].add(L(0,0,12,al2,""));
            p[14].add(L(1,0,12,al2,""));
            p[14].add(L(1,0,12,al1,"лари"));
            if (sw.length>1) p[14].add(L(1,1,12,al2,""+l)); else p[14].add(L(1,1,12,al2,""));

            p[15].add(L(0,1,12,al2,""));
            p[15].add(L(0,1,12,al2,""));
            p[15].add(L(1,1,12,al2,""));
            p[15].add(L(1,1,12,al1,""));
            p[15].add(L(1,1,12,al2,"%"));
        }
        if (dbn.equals("tx1")) {
            p[1].add(L(0,1,12,al2,"1 - сонли"));
            p[1].add(L(0,1,12,al2,"Ж А Д В А Л"));
            if (sw.length>1) p[1].add(L(1,1,12,al2,sw[2]+" йил "+k+" ойлик")); else p[1].add(L(1,1,12,al2,""));

            p[2].add(L(1,0,12,al2,""));
            p[2].add(L(1,0,12,al3,"Прокура"));
            if (sw.length>1) {int m=l-1; p[2].add(L(1,1,12,al2,""+m));} else p[2].add(L(1,1,12,al2,""));

            p[3].add(L(1,0,12,al3,"Кабул  к"));
            p[3].add(L(1,0,12,al2,"тура терго"));
            if (sw.length>1) p[3].add(L(1,1,12,al2,""+l)); else p[3].add(L(1,1,12,al2,""));

            p[4].add(L(1,0,12,al1,"илинган"));
            p[4].add(L(1,1,12,al1,"вчилари"));
            p[4].add(L(1,1,12,al2,"%"));

            p[5].add(L(1,0,12,al2,"ишлар"));
            p[5].add(L(1,0,12,al2,"ИИВ"));
            if (sw.length>1) {int m=l-1; p[5].add(L(1,1,12,al2,""+m));} else p[5].add(L(1,1,12,al2,""));

            p[6].add(L(1,0,12,al1,"сони"));
            p[6].add(L(1,0,12,al3,"терговчи"));
            if (sw.length>1) p[6].add(L(1,1,12,al2,""+l)); else p[6].add(L(1,1,12,al2,""));

            p[7].add(L(1,1,12,al2,""));
            p[7].add(L(1,1,12,al1,"лари"));
            p[7].add(L(1,1,12,al2,"%"));

            p[8].add(L(1,0,12,al2,""));
            p[8].add(L(1,0,12,al3,"Прокура"));
            if (sw.length>1) {int m=l-1; p[8].add(L(1,1,12,al2,""+m));} else p[8].add(L(1,1,12,al2,""));

            p[9].add(L(1,0,12,al3,"Тамом  к"));
            p[9].add(L(1,0,12,al2,"тура терго"));
            if (sw.length>1) p[9].add(L(1,1,12,al2,""+l)); else p[9].add(L(1,1,12,al2,""));

            p[10].add(L(1,0,12,al1,"илинган"));
            p[10].add(L(1,1,12,al1,"вчилари"));
            p[10].add(L(1,1,12,al2,"%"));

            p[11].add(L(1,0,12,al2,"ишлар"));
            p[11].add(L(1,0,12,al2,"ИИВ"));
            if (sw.length>1) {int m=l-1; p[11].add(L(1,1,12,al2,""+m));} else p[11].add(L(1,1,12,al2,""));

            p[12].add(L(1,0,12,al1,"сони"));
            p[12].add(L(1,0,12,al3,"терговчи"));
            if (sw.length>1) p[12].add(L(1,1,12,al2,""+l)); else p[12].add(L(1,1,12,al2,""));

            p[13].add(L(1,1,12,al2,""));
            p[13].add(L(1,1,12,al1,"лари"));
            p[13].add(L(1,1,12,al2,"%"));
        }
        if (dbn.equals("tx0")) {
            p[1].add(L(0,0,10,al2,""));
            p[1].add(L(1,0,10,al2,""));

            p[2].add(L(0,1,10,al2,""));
            p[2].add(L(1,1,10,al2,""));

            p[3].add(L(0,1,10,al2,""));
            p[3].add(L(1,1,10,al2,""));

            p[4].add(L(1,0,10,al3,"Тергов"));
            p[4].add(L(1,1,10,al2,"Прокуратура"));

            p[5].add(L(1,1,10,al1,"чилар"));
            p[5].add(L(1,1,10,al2,"ИИВ"));

            p[6].add(L(0,1,10,al2,"Шу жумладан"));
            p[6].add(L(1,1,10,al2,"в/е нисбатан"));
        }
        if (dbn.equals("userw")) {
            p[1].add(L(1,1,10,al2,"1"));
            p[2].add(L(1,1,10,al2,"2"));
            p[3].add(L(1,1,10,al2,"3"));
            p[4].add(L(1,1,10,al2,"4"));
            p[5].add(L(1,1,10,al2,"5"));
            p[6].add(L(1,1,10,al2,"6"));
            p[7].add(L(1,1,10,al2,"7"));
            p[8].add(L(1,1,10,al2,"8"));
        }
    }
}