package buhuchet;

import javax.swing.*;
import javax.swing.text.*;

public class KeyF8 {
    Buhuchet      signin;
    ParamsTables  zpt,zpt_t1,zpt_t2,zpt_t4,zpt_t5,zpt_t6,zpt_t9;
    JTextComponent[][] rows,rows_t1,rows_t2,rows_t4,rows_t5,rows_t6,rows_t9,rowsOld;
    int           kerr=0;
    String        serr="";

    String getLast(String dbn) {
        String d="";
        String[] sx=dbn.split("_");
        String dbx=sx[0]+"_"+sx[1]+"_"+sx[2]+"_"; String db=""; int month=new Integer(sx[3]);
        for (int i=month-1; i>0; i--) {
            if (i<10) db=dbx+"0"+i; else db=dbx+i;
            if (signin.sql.hasTable(db)==1) {d=db; break;}
        }
        return d;
    }
    String kerr_serr(int m) {
        serr="Жами "+kerr+" та хато!"+serr; if (m==0) {if (kerr>0) serr=""+kerr; else serr="";}
        return serr;
    }
    void serr(String s) {kerr=kerr+1; serr=serr+"_xtx_"+kerr+"-хато: "+s;}
    String getErrors(int m) {
        String sk="0"; String[] st=zpt.dbName.split("_"); String s=st[0];
        if (s.equals("xtx0")) sk=findErrorx0(m);
        else {
            String sx=s.substring(0,1);
            if (!sx.equals("x")) s="x"+s;

            if (!s.equals("xt10")) {
                if (sx.equals("x")) {
                    String d=getLast(zpt.dbName);
                    if (!d.equals("")) {
                        rowsOld=signin.sql.getVector("select * from "+d+" order by p0 asc",zpt);
                        int k=rowsOld[0].length-zpt.colEdit-1;
                        for (int i=1; i<=rowsOld.length; i++) {
                            if (s.equals("xt2")) {
                                if (i>=34&&i<=37) continue;
                                if (i>=49) continue;
                            }
                            if (s.equals("xt4")) {
                                if (i==20) continue;
                            }
                            if (s.equals("xt6")) {
                                if (i==8) continue;
                            }
                            for (int j=1; j<=k; j++) {
                                int x=get(rows,zpt,i,j); int y=get(rowsOld,zpt,i,j);
                                if (x<y) serr(""+i+"-катор "+j+"-устундаги ракам олдинги ой ушбу ячейкадаги ракамдан"+
                                              " кичик яъни "+x+"<"+y);
                            }
                        }
                    }
                }
            }
            if (s.equals("xt1"))  sk=findError1(m);  if (s.equals("xt2"))  sk=findError2(m);
            if (s.equals("xt3"))  sk=findError3(m);  if (s.equals("xt4"))  sk=findError4(m);
            if (s.equals("xt5"))  sk=findError5(m);  if (s.equals("xt6"))  sk=findError6(m);
            if (s.equals("xt7"))  sk=findError7(m);  if (s.equals("xt8"))  sk=findError8(m);
            if (s.equals("xt9"))  sk=findError9(m);  if (s.equals("xt10")) sk=findError10(m);
            if (s.equals("xt11")) sk=findError11(m); if (s.equals("xt12")) sk=findError12(m);
        }
        return sk;
    }
    String findError1(int m)  {
        for (int i=1; i<15; i++) if (get(rows,zpt,10,i)<get(rows,zpt,11,i))
            serr("10-катор "+i+"-устундаги ракам 11-катор "+i+"-устундаги ракамдан кичик яъни "+
                  get(rows,zpt,10,i)+"<"+get(rows,zpt,11,i));

        for (int i=1; i<15; i++) if (get(rows,zpt,17,i)<get(rows,zpt,18,i))
            serr("17-катор "+i+"-устундаги ракам 18-катор "+i+"-устундаги ракамдан кичик яъни "+
                  get(rows,zpt,17,i)+"<"+get(rows,zpt,18,i));

        for (int i=1; i<15; i++) if (get(rows,zpt,40,i)<get(rows,zpt,41,i))
            serr("40-катор "+i+"-устундаги ракам 41-катор "+i+"-устундаги ракамдан кичик яъни "+
                  get(rows,zpt,40,i)+"<"+get(rows,zpt,41,i));

        for (int i=1; i<47; i++) {
            for (int j=0; j<7; j++) {
                if (j==2) continue; int nx=2*j+1; int ny=2*j+2;
                if (get(rows,zpt,i,nx)>get(rows,zpt,i,ny))
                    serr(""+i+"-катор "+nx+"-устундаги ракам "+i+"-катор "+ny+"-устундаги ракамдан катта яъни "+
                         get(rows,zpt,i,nx)+">"+get(rows,zpt,i,ny));
            }
        }
        return kerr_serr(m);
    }
    String findError2(int m)  {
        int x=get(rows,zpt,13,1)+get(rows,zpt,38,1)+get(rows,zpt,40,1)+get(rows,zpt,42,1)+get(rows,zpt,49,1);
        int y=get(rows,zpt,1,1)+get(rows,zpt,3,1);
        if (x!=y) serr("13,38,40,42,49-каторлар 1-устунидаги ракамларнинг йигиндиси 1 ва 3-каторлар"+
                       " 1-устунидаги ракамлари йигиндисига тенг булиши керак яъни "+x+"!="+y);
        x=get(rows,zpt,13,2)+get(rows,zpt,38,2)+get(rows,zpt,40,2)+get(rows,zpt,42,2)+get(rows,zpt,49,2);
        y=get(rows,zpt,1,2)+get(rows,zpt,3,2);
        if (x!=y) serr("13,38,40,42,49-каторлар 2-устунидаги ракамларнинг йигиндиси 1 ва 3-каторлар"+
                       " 2-устунидаги ракамлари йигиндисига тенг булиши керак яъни "+x+"!="+y);
        x=get(rows,zpt,14,1)+get(rows,zpt,39,1)+get(rows,zpt,41,1)+get(rows,zpt,43,1)+get(rows,zpt,50,1);
        y=get(rows,zpt,2,1)+get(rows,zpt,4,1);
        if (x!=y)
            serr("14,39,41,43,50-каторлар 1-устунидаги ракамларнинг йигиндиси 2 ва 4-каторлар 1-устунидаги ракамлари йигиндисига тенг булиши керак яъни "+x+"!="+y);
        x=get(rows,zpt,14,2)+get(rows,zpt,39,2)+get(rows,zpt,41,2)+get(rows,zpt,43,2)+get(rows,zpt,50,2);
        y=get(rows,zpt,2,2)+get(rows,zpt,4,2);
        if (x!=y) serr("14,39,41,43,50-каторлар 2-устунидаги ракамларнинг йигиндиси 2 ва 4-каторлар 2-устунидаги ракамлари йигиндисига тенг булиши керак яъни "+x+"!="+y);

        x=get(rows,zpt,19,1)+get(rows,zpt,21,1)+get(rows,zpt,23,1)+get(rows,zpt,25,1)+get(rows,zpt,26,1);
        y=get(rows,zpt,13,1);
        if (x!=y) serr("13-катор 1-устундаги ракам 19,21,23,25,26 -каторларнинг 1-устунларидаги ракамлар йигиндисига тенг булиши керак яъни "+y+"!="+x);
        x=get(rows,zpt,19,2)+get(rows,zpt,21,2)+get(rows,zpt,23,2)+get(rows,zpt,25,2)+get(rows,zpt,26,2);
        y=get(rows,zpt,13,2);
        if (x!=y) serr("13-катор 2-устундаги ракам 19,21,23,25,26 -каторларнинг 2-устунларидаги ракамлар йигиндисига тенг булиши керак яъни "+y+"!="+x);

        x=get(rows_t1,zpt_t1,45,5)+get(rows_t4,zpt_t4,16,1)+get(rows_t6,zpt_t6,3,1);
        y=get(rows,zpt,26,1);
        if (y!=x) serr("26-каторнинг 1-устунидаги ракам I-бўлим 1-жадвал 45-катор 5-устундаги,"+
         "II-бўлим 2-жадвал 16-катор 1-устундаги ва 4-жадвал 3-каторнинг 1-устунидаги ракамлар йигиндисига тенг булиши керак яъни "+y+"!="+x);
        x=get(rows_t1,zpt_t1,45,6)+get(rows_t4,zpt_t4,16,2)+get(rows_t6,zpt_t6,3,2);
        y=get(rows,zpt,26,2);
        if (y!=x) serr("26-каторнинг 2-устунидаги ракам I-бўлим 1-жадвал 45-катор 6-устундаги,"+
                                         "II-бўлим 2-жадвал 16-катор 2-устундаги ва 4-жадвал 3-каторнинг 2-устунидаги ракамлар йигиндисига тенг булиши керак яъни "+y+"!="+x);

        if (get(rows,zpt,43,1)<get(rows,zpt,46,1)) serr("43-катор 1-устундаги ракам 46-катор 1-устундаги ракамдан катта еки тенг булиши керак яъни "+get(rows,zpt,43,1)+"<"+get(rows,zpt,46,1));
        if (get(rows,zpt,43,2)<get(rows,zpt,46,2)) serr("43-катор 2-устундаги ракам 46-катор 2-устундаги ракамдан катта еки тенг булиши керак яъни "+get(rows,zpt,43,2)+"<"+get(rows,zpt,46,2));

        x=get(rows,zpt,54,1);
        y=get(rows,zpt,55,1)+get(rows,zpt,56,1)+get(rows,zpt,57,1);
        if (x<y) serr("54-катор 1-устундаги ракам 55,56,57-каторлар 1-устунларидаги ракамлар йигиндисидан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,54,2);
        y=get(rows,zpt,55,2)+get(rows,zpt,56,2)+get(rows,zpt,57,2);
        if (x<y) serr("54-катор 2-устундаги ракам 55,56,57-каторлар 2-устунларидаги ракамлар йигиндисидан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,49,1);
        y=get(rows,zpt,51,1)+get(rows,zpt,52,1)+get(rows,zpt,53,1);
        if (x<y) serr("49-катор 1-устундаги ракам 51,52,53-каторлар 1-устунларидаги ракамлар йигиндисидан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,49,2);
        y=get(rows,zpt,51,2)+get(rows,zpt,52,2)+get(rows,zpt,53,2);
        if (x<y) serr("49-катор 2-устундаги ракам 51,52,53-каторлар 2-устунларидаги ракамлар йигиндисидан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,1,1); y=get(rows,zpt,2,1);
        if (x<y) serr("1-катор 1-устундаги ракам 2-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,2); y=get(rows,zpt,2,2);
        if (x<y) serr("1-катор 2-устундаги ракам 2-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,13,1); y=get(rows,zpt,14,1);
        if (x<y) serr("13-катор 1-устундаги ракам 14-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,13,2); y=get(rows,zpt,14,2);
        if (x<y) serr("13-катор 2-устундаги ракам 14-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,19,1); y=get(rows,zpt,20,1);
        if (x<y) serr("19-катор 1-устундаги ракам 20-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,19,2); y=get(rows,zpt,20,2);
        if (x<y) serr("19-катор 2-устундаги ракам 20-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,21,1); y=get(rows,zpt,22,1);
        if (x<y) serr("21-катор 1-устундаги ракам 22-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,21,2); y=get(rows,zpt,22,2);
        if (x<y) serr("21-катор 2-устундаги ракам 22-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,23,1); y=get(rows,zpt,24,1);
        if (x<y) serr("23-катор 1-устундаги ракам 24-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,23,2); y=get(rows,zpt,24,2);
        if (x<y) serr("23-катор 2-устундаги ракам 24-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,26,1); y=get(rows,zpt,27,1);
        if (x<y) serr("26-катор 1-устундаги ракам 27-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,26,2); y=get(rows,zpt,27,2);
        if (x<y) serr("26-катор 2-устундаги ракам 27-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,28,1); y=get(rows,zpt,29,1);
        if (x<y) serr("28-катор 1-устундаги ракам 29-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,28,2); y=get(rows,zpt,29,2);
        if (x<y) serr("28-катор 2-устундаги ракам 29-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,30,1); y=get(rows,zpt,31,1);
        if (x<y) serr("30-катор 1-устундаги ракам 31-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,30,2); y=get(rows,zpt,31,2);
        if (x<y) serr("30-катор 2-устундаги ракам 31-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,32,1); y=get(rows,zpt,33,1);
        if (x<y) serr("32-катор 1-устундаги ракам 33-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,32,2); y=get(rows,zpt,33,2);
        if (x<y) serr("32-катор 2-устундаги ракам 33-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,34,1); y=get(rows,zpt,35,1);
        if (x<y) serr("34-катор 1-устундаги ракам 35-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,34,2); y=get(rows,zpt,35,2);
        if (x<y) serr("34-катор 2-устундаги ракам 35-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,36,1); y=get(rows,zpt,37,1);
        if (x<y) serr("36-катор 1-устундаги ракам 37-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,36,2); y=get(rows,zpt,37,2);
        if (x<y) serr("36-катор 2-устундаги ракам 37-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,38,1); y=get(rows,zpt,39,1);
        if (x<y) serr("38-катор 1-устундаги ракам 39-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,38,2); y=get(rows,zpt,39,2);
        if (x<y) serr("38-катор 2-устундаги ракам 39-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,40,1); y=get(rows,zpt,41,1);
        if (x<y) serr("40-катор 1-устундаги ракам 41-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,40,2); y=get(rows,zpt,41,2);
        if (x<y) serr("40-катор 2-устундаги ракам 41-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,42,1); y=get(rows,zpt,43,1);
        if (x<y) serr("42-катор 1-устундаги ракам 43-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,42,2); y=get(rows,zpt,43,2);
        if (x<y) serr("42-катор 2-устундаги ракам 43-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,49,1); y=get(rows,zpt,50,1);
        if (x<y) serr("49-катор 1-устундаги ракам 50-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,49,2); y=get(rows,zpt,50,2);
        if (x<y) serr("49-катор 2-устундаги ракам 50-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
/*
        x=get(rows_t5,zpt_t5,1,1)+get(rows_t5,zpt_t5,1,2)+get(rows_t5,zpt_t5,18,1)+get(rows_t5,zpt_t5,18,2)+
          get(rows_t5,zpt_t5,20,1)+get(rows_t5,zpt_t5,20,2);
        y=get(rows,zpt,11,1);
        if (y<x) serr("11-катор 1-устунидаги ракам II-булим 3-жадвал 1-катор 1-устун,2-устун ва 18-катор 1-устун,2-устун"+
                      " 20-катор 1-устун,2-устунларидаги ракамлар йигиндисидан катта еки тенг булиши керак яъни "+y+"<"+x);
        x=get(rows_t5,zpt_t5,1,3)+get(rows_t5,zpt_t5,1,4)+get(rows_t5,zpt_t5,18,3)+get(rows_t5,zpt_t5,18,4)+
          get(rows_t5,zpt_t5,20,3)+get(rows_t5,zpt_t5,20,4);
        y=get(rows,zpt,11,2);
        if (y<x) serr("11-катор 2-устунидаги ракам II-булим 3-жадвал 1-катор 3-устун,4-устун ва 18-катор 3-устун,4-устун"+
                      " 20-катор 3-устун,4-устунларидаги ракамлар йигиндисидан катта еки тенг булиши керак яъни "+y+"<"+x);
*/
        x=get(rows_t5,zpt_t5,1,2)+get(rows_t5,zpt_t5,20,2)+get(rows_t5,zpt_t5,22,2);
        y=get(rows,zpt,11,1);
        if (y<x) serr("11-катор 1-устунидаги ракам II-булим 3-жадвал 1-катор 2-устун,20-катор 2-устун ва 22-катор 2-устун"+
                      "ларидаги ракамлар йигиндисидан катта еки тенг булиши керак яъни "+y+"<"+x);
        x=get(rows_t5,zpt_t5,1,4)+get(rows_t5,zpt_t5,20,4)+get(rows_t5,zpt_t5,22,4);
        y=get(rows,zpt,11,2);
        if (y<x) serr("11-катор 2-устунидаги ракам II-булим 3-жадвал 1-катор 4-устун,20-катор 4-устун ва 22-катор 4-устун"+
                      "ларидаги ракамлар йигиндисидан катта еки тенг булиши керак яъни "+y+"<"+x);

        return kerr_serr(m);
    }
    String findError3(int m)  {
        int x=get(rows,zpt,7,1)+get(rows,zpt,8,1)+get(rows,zpt,9,1);
        if (get(rows,zpt,5,1)!=x) serr("7-9-каторлар 1-устунларидаги ракамлар йигиндиси 5-катор 1-устундаги ракамга тенг булиши керак яъни "+get(rows,zpt,5,1)+"!="+x);
            x=get(rows,zpt,7,2)+get(rows,zpt,8,2)+get(rows,zpt,9,2);
        if (get(rows,zpt,5,2)!=x) serr("7-9-каторлар 2-устунларидаги ракамлар йигиндиси 5-катор 2-устундаги ракамга тенг булиши керак яъни "+get(rows,zpt,5,2)+"!="+x);
        x=0; for (int i=10; i<28; i++) if (i!=13) x=x+get(rows,zpt,i,1);
        if (get(rows,zpt,5,1)!=x) serr("10-12,14-27-каторлар 1-устунларидаги ракамлар йигиндиси 5-катор 1-устундаги ракамга тенг булиши керак яъни "+get(rows,zpt,5,1)+"!="+x);
        x=0; for (int i=10; i<28; i++) if (i!=13) x=x+get(rows,zpt,i,2);
        if (get(rows,zpt,5,2)!=x) serr("10-12,14-27-каторлар 2-устунларидаги ракамлар йигиндиси 5-катор 2-устундаги ракамга тенг булиши керак яъни "+get(rows,zpt,5,2)+"!="+x);

        x=0; for (int i=2; i<6; i++) x=x+get(rows,zpt,i,1);
        if (get(rows,zpt,1,1)!=x) serr("2-5 каторлар 1-устунларидаги ракамлар йигиндиси 1-катор 1-устундаги сонга тенг булиши керак яъни "+get(rows,zpt,1,1)+"!="+x);

        x=0; for (int i=2; i<6; i++) x=x+get(rows,zpt,i,2);
        if (get(rows,zpt,1,2)!=x) serr("2-5 каторлар 2-устунларидаги ракамлар йигиндиси 1-катор 2-устундаги сонга тенг булиши керак яъни "+get(rows,zpt,1,2)+"!="+x);

        x=0; for (int i=10; i<24; i++) if (i!=13) x=x+get(rows,zpt,i,1);
        int y=get(rows,zpt,7,1)+get(rows,zpt,8,1);
        if (y>x) serr("7 ва 8-каторлар 1-устунларидаги ракамлар йигиндиси 10-12,14-23-каторлар 1-устунларидаги ракамлар йигиндисига тенг булиши керак яъни "+y+">"+x);
        x=0; for (int i=10; i<24; i++) if (i!=13) x=x+get(rows,zpt,i,2);
        y=get(rows,zpt,7,2)+get(rows,zpt,8,2);
        if (y>x) serr("7 ва 8-каторлар 2-устунларидаги ракамлар йигиндиси 10-12,14-23-каторлар 2-устунларидаги ракамлар йигиндисига тенг булиши керак яъни "+y+">"+x);

        x=0; for (int i=24; i<28; i++) x=x+get(rows,zpt,i,1);
        if (get(rows,zpt,9,1)>x) serr("9-катор 1-устундаги ракам 24-27-каторлар 1-устунларидаги ракамлар йигиндисига тенг булиши керак яъни "+get(rows,zpt,9,1)+">"+x);
        x=0; for (int i=24; i<28; i++) x=x+get(rows,zpt,i,2);
        if (get(rows,zpt,9,2)>x) serr("9-катор 2-устундаги ракам 24-27-каторлар 2-устунларидаги ракамлар йигиндисига тенг булиши керак яъни "+get(rows,zpt,9,2)+">"+x);

        return kerr_serr(m);
    }
    String findError4(int m)  {
        int x=0; for (int i=1; i<13; i++) x=x+get(rows,zpt,i,1);
        if (get(rows_t1,zpt_t1,45,5)!=x) serr("I-бўлим 1-жадвалнинг 45-катор 5-устунидаги ракам II-бўлим 2-жадвалининг 1-12-каторлар 1-устунларидаги ракамлар йигиндисига тенг булиши керак яъни "+get(rows_t1,zpt_t1,45,5)+"!="+x);
        x=0; for (int i=1; i<13; i++) x=x+get(rows,zpt,i,2);
        if (get(rows_t1,zpt_t1,45,6)!=x) serr("I-бўлим 1-жадвалнинг 45-катор 6-устунидаги ракам II-бўлим 2-жадвалининг 1-12-каторлар 2-устунларидаги ракамлар йигиндисига тенг булиши керак яъни "+get(rows_t1,zpt_t1,45,6)+"!="+x);

        x=0; for (int i=15; i<21; i++) x=x+get(rows,zpt,i,1);
        if (get(rows,zpt,13,1)>x) serr("13-катор 1-устундаги ракам 15-20-каторлар 1-устунларида тула акс этмаган яъни "+get(rows,zpt,13,1)+">"+x);
        x=0; for (int i=15; i<21; i++) x=x+get(rows,zpt,i,2);
        if (get(rows,zpt,13,2)>x) serr("13-катор 2-устундаги ракам 15-20-каторлар 2-устунларида тула акс этмаган яъни "+get(rows,zpt,13,2)+">"+x);
/*
        x=0; for (int i=19; i<26; i++) x=x+get(rows_t2,zpt_t2,i,1);
        if (get(rows,zpt,15,1)>x) serr("15-катор 1-устунидаги ракм I-бўлим 2-жадвалининг 19-25-катор 1-устунларида тула акс этмаган яъни "+get(rows,zpt,15,1)+">"+x);
        x=0; for (int i=19; i<26; i++) x=x+get(rows_t2,zpt_t2,i,2);
        if (get(rows,zpt,15,2)>x) serr("15-катор 2-устунидаги ракм I-бўлим 2-жадвалининг 19-25-катор 2-устунларида тула акс этмаган яъни "+get(rows,zpt,15,2)+">"+x);
*/
/*
        x=get(rows,zpt,16,1)+get(rows_t4,zpt_t4,3,1)+get(rows_t1,zpt_t1,45,5);
        if (get(rows_t2,zpt_t2,26,1)>x) serr("16-катор 1-устундаги, 4-жадвал 3-катор 1-устунидаги I-бўлим 1-жадвали 5-устундаги ракамлар I-бўлим 2-жадвалининг 26-катор 1-устунида тула акс этмаган яъни "+get(rows_t2,zpt_t2,26,1)+">"+x);
        x=get(rows,zpt,16,2)+get(rows_t4,zpt_t4,3,2)+get(rows_t1,zpt_t1,45,6);
        if (get(rows_t2,zpt_t2,26,2)>x) serr("16-катор 2-устундаги, 4-жадвал 3-катор 2-устунидаги I-бўлим 1-жадвали 6-устундаги ракамлар I-бўлим 2-жадвалининг 26-катор 2-устунида тула акс этмаган яъни "+get(rows_t2,zpt_t2,26,2)+">"+x);
*/

        return kerr_serr(m);
    }
    String findError5(int m)  {

        int x=0; for (int i=3; i<20; i++) x=x+get(rows,zpt,i,1);
        if (get(rows,zpt,1,1)<x) serr("1-катор 1-устунидаги ракам 3-19-каторлар 1-устунидаги ракамлар йигиндисидан кам бўлмаслиги лозим яъни "+get(rows,zpt,1,1)+"<"+x);
        x=0; for (int i=3; i<20; i++) x=x+get(rows,zpt,i,2);
        if (get(rows,zpt,1,2)<x) serr("1-катор 2-устунидаги ракам 3-19-каторлар 2-устунидаги ракамлар йигиндисидан кам бўлмаслиги лозим яъни "+get(rows,zpt,1,2)+"<"+x);
        x=0; for (int i=3; i<20; i++) x=x+get(rows,zpt,i,3);
        if (get(rows,zpt,1,3)<x) serr("1-катор 3-устунидаги ракам 3-19-каторлар 3-устунидаги ракамлар йигиндисидан кам бўлмаслиги лозим яъни "+get(rows,zpt,1,3)+"<"+x);
        x=0; for (int i=3; i<20; i++) x=x+get(rows,zpt,i,4);
        if (get(rows,zpt,1,4)<x) serr("1-катор 4-устунидаги ракам 3-19-каторлар 4-устунидаги ракамлар йигиндисидан кам бўлмаслиги лозим яъни "+get(rows,zpt,1,4)+"<"+x);

        x=get(rows,zpt,1,1); int y=get(rows,zpt,2,1);
        if (x<y) serr("1-катор 1-устундаги ракам 2-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,2); y=get(rows,zpt,2,2);
        if (x<y) serr("1-катор 2-устундаги ракам 2-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,3); y=get(rows,zpt,2,3);
        if (x<y) serr("1-катор 3-устундаги ракам 2-катор 3-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,4); y=get(rows,zpt,2,4);
        if (x<y) serr("1-катор 4-устундаги ракам 2-катор 4-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,20,1); y=get(rows,zpt,21,1);
        if (x<y) serr("20-катор 1-устундаги ракам 21-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,20,2); y=get(rows,zpt,21,2);
        if (x<y) serr("20-катор 2-устундаги ракам 21-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,20,3); y=get(rows,zpt,21,3);
        if (x<y) serr("20-катор 3-устундаги ракам 21-катор 3-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,20,4); y=get(rows,zpt,21,4);
        if (x<y) serr("20-катор 4-устундаги ракам 21-катор 4-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,22,1); y=get(rows,zpt,23,1);
        if (x<y) serr("22-катор 1-устундаги ракам 23-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,22,2); y=get(rows,zpt,23,2);
        if (x<y) serr("22-катор 2-устундаги ракам 23-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,22,3); y=get(rows,zpt,23,3);
        if (x<y) serr("22-катор 3-устундаги ракам 23-катор 3-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,22,4); y=get(rows,zpt,23,4);
        if (x<y) serr("22-катор 4-устундаги ракам 23-катор 4-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);


        return kerr_serr(m);
    }
    String findError6(int m)  {
/*
        int x=get(rows,zpt,1,1)+get(rows,zpt,3,1)+get(rows,zpt,5,1)+get(rows,zpt,6,1)+get(rows,zpt,7,1)+get(rows,zpt,8,1);
        int y=get(rows_t5,zpt_t5,1,1)+get(rows_t5,zpt_t5,1,2);
        if (x<y) serr("4-жадвалнинг 1-устун 1,3,5-8-каторларидаги ракамлар йигиндиси 3-жадвал 1-катор 1 ва 2 устунлар йигинисидан катта еки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,2)+get(rows,zpt,3,2)+get(rows,zpt,5,2)+get(rows,zpt,6,2)+get(rows,zpt,7,2)+get(rows,zpt,8,2);
        y=get(rows_t5,zpt_t5,1,3)+get(rows_t5,zpt_t5,1,4);
        if (x<y) serr("4-жадвалнинг 2-устун 1,3,5-8-каторларидаги ракамлар йигиндиси 3-жадвал 1-катор 3 ва 4 устунлар йигинисидан катта еки тенг бўлиши керак яъни "+x+"<"+y);
*/
        int x=get(rows,zpt,1,1); int y=get(rows,zpt,2,1);
        if (x<y) serr("1-катор 1-устундаги ракам 2-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,2); y=get(rows,zpt,2,2);
        if (x<y) serr("1-катор 2-устундаги ракам 2-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,3); y=get(rows,zpt,2,3);
        if (x<y) serr("1-катор 3-устундаги ракам 2-катор 3-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,4); y=get(rows,zpt,2,4);
        if (x<y) serr("1-катор 4-устундаги ракам 2-катор 4-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,5); y=get(rows,zpt,2,5);
        if (x<y) serr("1-катор 5-устундаги ракам 2-катор 5-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,6); y=get(rows,zpt,2,6);
        if (x<y) serr("1-катор 6-устундаги ракам 2-катор 6-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,7); y=get(rows,zpt,2,7);
        if (x<y) serr("1-катор 7-устундаги ракам 2-катор 7-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,8); y=get(rows,zpt,2,8);
        if (x<y) serr("1-катор 8-устундаги ракам 2-катор 8-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,3,1); y=get(rows,zpt,4,1);
        if (x<y) serr("3-катор 1-устундаги ракам 4-катор 1-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,3,2); y=get(rows,zpt,4,2);
        if (x<y) serr("3-катор 2-устундаги ракам 4-катор 2-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,3,3); y=get(rows,zpt,4,3);
        if (x<y) serr("3-катор 3-устундаги ракам 4-катор 3-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,3,4); y=get(rows,zpt,4,4);
        if (x<y) serr("3-катор 4-устундаги ракам 4-катор 4-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,3,5); y=get(rows,zpt,4,5);
        if (x<y) serr("3-катор 5-устундаги ракам 4-катор 5-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,3,6); y=get(rows,zpt,4,6);
        if (x<y) serr("3-катор 6-устундаги ракам 4-катор 6-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,3,7); y=get(rows,zpt,4,7);
        if (x<y) serr("3-катор 7-устундаги ракам 4-катор 7-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,3,8); y=get(rows,zpt,4,8);
        if (x<y) serr("3-катор 8-устундаги ракам 4-катор 8-устунидаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,1,3)+get(rows,zpt,3,3)+get(rows,zpt,5,3)+get(rows,zpt,6,3)+get(rows,zpt,7,3)+get(rows,zpt,8,3);
        y=get(rows_t5,zpt_t5,1,1)+get(rows_t5,zpt_t5,1,2);
        if (x<y) serr("4-жадвалнинг 3-устун 1,3,5-8-каторларидаги ракамлар йигиндиси 3-жадвал 1-катор 1 ва 2 устунлар йигинисидан катта еки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,4)+get(rows,zpt,3,4)+get(rows,zpt,5,4)+get(rows,zpt,6,4)+get(rows,zpt,7,4)+get(rows,zpt,8,4);
        y=get(rows_t5,zpt_t5,1,3)+get(rows_t5,zpt_t5,1,4);
        if (x<y) serr("4-жадвалнинг 4-устун 1,3,5-8-каторларидаги ракамлар йигиндиси 3-жадвал 1-катор 3 ва 4 устунлар йигинисидан катта еки тенг бўлиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,1,5)+get(rows,zpt,3,5)+get(rows,zpt,5,5)+get(rows,zpt,6,5)+get(rows,zpt,7,5)+get(rows,zpt,8,5);
        y=get(rows_t5,zpt_t5,20,1)+get(rows_t5,zpt_t5,20,2);
        if (x<y) serr("4-жадвалнинг 5-устун 1,3,5-8-каторларидаги ракамлар йигиндиси 3-жадвал 20-катор 1 ва 2 устунлар йигинисидан катта еки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,6)+get(rows,zpt,3,6)+get(rows,zpt,5,6)+get(rows,zpt,6,6)+get(rows,zpt,7,6)+get(rows,zpt,8,6);
        y=get(rows_t5,zpt_t5,20,3)+get(rows_t5,zpt_t5,20,4);
        if (x<y) serr("4-жадвалнинг 6-устун 1,3,5-8-каторларидаги ракамлар йигиндиси 3-жадвал 20-катор 3 ва 4 устунлар йигинисидан катта еки тенг бўлиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,1,7)+get(rows,zpt,3,7)+get(rows,zpt,5,7)+get(rows,zpt,6,7)+get(rows,zpt,7,7)+get(rows,zpt,8,7);
        y=get(rows_t5,zpt_t5,22,1)+get(rows_t5,zpt_t5,22,2);
        if (x<y) serr("4-жадвалнинг 7-устун 1,3,5-8-каторларидаги ракамлар йигиндиси 3-жадвал 22-катор 1 ва 2 устунлар йигинисидан катта еки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,8)+get(rows,zpt,3,8)+get(rows,zpt,5,8)+get(rows,zpt,6,8)+get(rows,zpt,7,8)+get(rows,zpt,8,8);
        y=get(rows_t5,zpt_t5,22,3)+get(rows_t5,zpt_t5,22,4);
        if (x<y) serr("4-жадвалнинг 8-устун 1,3,5-8-каторларидаги ракамлар йигиндиси 3-жадвал 22-катор 3 ва 4 устунлар йигинисидан катта еки тенг бўлиши керак яъни "+x+"<"+y);


        return kerr_serr(m);
    }
    String findError7(int m)  {
        for (int i=1; i<11; i++) if (get(rows,zpt,1,i)<get(rows,zpt,2,i)) serr("1-катор "+i+"-устундаги ракам 2-катор "+i+"-устундаги ракамдан катта еки тенг булиши керак яъни "+get(rows,zpt,1,i)+"<"+get(rows,zpt,2,i));
        for (int i=1; i<11; i++) if (get(rows,zpt,3,i)<get(rows,zpt,4,i)) serr("3-катор "+i+"-устундаги ракам 4-катор "+i+"-устундаги ракамдан катта еки тенг булиши керак яъни "+get(rows,zpt,3,i)+"<"+get(rows,zpt,4,i));

        return kerr_serr(m);
    }
    String findError8(int m)  {
        int x=get(rows,zpt,1,1)+get(rows,zpt,1,2)+get(rows,zpt,1,3);
        int y=get(rows,zpt,3,1)+get(rows,zpt,3,2)+get(rows,zpt,3,3);
        y=y+get(rows,zpt,5,1)+get(rows,zpt,5,2)+get(rows,zpt,5,3);
        y=y+get(rows,zpt,7,1)+get(rows,zpt,7,2)+get(rows,zpt,7,3);
        y=y+get(rows,zpt,9,1)+get(rows,zpt,9,2)+get(rows,zpt,9,3);
        y=y+get(rows,zpt,11,1)+get(rows,zpt,11,2)+get(rows,zpt,11,3);
        if (x<y) serr("1-катордаги 1-3-устунлардаги ракамлар йигиндиси 3,5,7,9,11-каторларнинг 1-3-устунларидаги ракамлар йигиндисидан кам яъни "+x+"<"+y);

        x=get(rows,zpt,1,1); y=get(rows,zpt,2,1);
        if (x<y) serr("1-катор 1-устундаги ракам 2-катор 1-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,2); y=get(rows,zpt,2,2);
        if (x<y) serr("1-катор 2-устундаги ракам 2-катор 2-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,3); y=get(rows,zpt,2,3);
        if (x<y) serr("1-катор 3-устундаги ракам 2-катор 3-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,3,1); y=get(rows,zpt,4,1);
        if (x<y) serr("3-катор 1-устундаги ракам 4-катор 1-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,3,2); y=get(rows,zpt,4,2);
        if (x<y) serr("3-катор 2-устундаги ракам 4-катор 2-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,3,3); y=get(rows,zpt,4,3);
        if (x<y) serr("3-катор 3-устундаги ракам 4-катор 3-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,5,1); y=get(rows,zpt,6,1);
        if (x<y) serr("5-катор 1-устундаги ракам 6-катор 1-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,5,2); y=get(rows,zpt,6,2);
        if (x<y) serr("5-катор 2-устундаги ракам 6-катор 2-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,5,3); y=get(rows,zpt,6,3);
        if (x<y) serr("5-катор 3-устундаги ракам 6-катор 3-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,7,1); y=get(rows,zpt,8,1);
        if (x<y) serr("7-катор 1-устундаги ракам 8-катор 1-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,7,2); y=get(rows,zpt,8,2);
        if (x<y) serr("7-катор 2-устундаги ракам 8-катор 2-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,7,3); y=get(rows,zpt,8,3);
        if (x<y) serr("7-катор 3-устундаги ракам 8-катор 3-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,9,1); y=get(rows,zpt,10,1);
        if (x<y) serr("9-катор 1-устундаги ракам 10-катор 1-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,9,2); y=get(rows,zpt,10,2);
        if (x<y) serr("9-катор 2-устундаги ракам 10-катор 2-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,9,3); y=get(rows,zpt,10,3);
        if (x<y) serr("9-катор 3-устундаги ракам 10-катор 3-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,11,1); y=get(rows,zpt,12,1);
        if (x<y) serr("11-катор 1-устундаги ракам 12-катор 1-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,11,2); y=get(rows,zpt,12,2);
        if (x<y) serr("11-катор 2-устундаги ракам 12-катор 2-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,11,3); y=get(rows,zpt,12,3);
        if (x<y) serr("11-катор 3-устундаги ракам 12-катор 3-устундаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);

        return kerr_serr(m);
    }
    String findError9(int m)  {
/*
        int x=get(rows,zpt,12,1)+get(rows_t6,zpt_t6,2,1)+get(rows_t6,zpt_t6,2,2);
        int y=get(rows_t2,zpt_t2,20,1)+get(rows_t2,zpt_t2,20,2)+get(rows_t2,zpt_t2,22,1)+get(rows_t2,zpt_t2,22,2);
        y=y+get(rows_t2,zpt_t2,24,1)+get(rows_t2,zpt_t2,24,2);
        if (x!=y) serr("12-катор 1-устундаги ракам ва 2-булим 4-жадвал 2-катор 1 ва 2 устунлардаги ракамлар йигиндиси 1-булим 2-жадвал 20,22,24-катор 1 ва 2 устундаги ракамлар йигиндисига тенг булиши керак яъни "+x+"!="+y);
*/
        for (int i=1; i<17; i++) {
            if (i==14) continue;
            if (get(rows,zpt,i,1)>get(rows,zpt,i,3)) serr(""+i+"-катор 1-устундаги ракам "+i+"-катор 3-устундаги ракамдан кичик еки тенг булиши керак яъни "+get(rows,zpt,i,1)+">"+get(rows,zpt,i,3));
            if (get(rows,zpt,i,2)<get(rows,zpt,i,3)) serr(""+i+"-катор 2-устундаги ракам "+i+"-катор 3-устундаги ракамдан катта еки тенг булиши керак яъни "+get(rows,zpt,i,2)+">"+get(rows,zpt,i,3));
        }
//
        int x=get(rows_t2,zpt_t2,20,1)+get(rows_t2,zpt_t2,20,2)+get(rows_t2,zpt_t2,22,1)+get(rows_t2,zpt_t2,22,2)+
        get(rows_t2,zpt_t2,24,1)+get(rows_t2,zpt_t2,24,2)+get(rows_t2,zpt_t2,27,1)+get(rows_t2,zpt_t2,27,2)+get(rows,zpt,15,1);

        int y=get(rows_t2,zpt_t2,14,1)+get(rows_t2,zpt_t2,14,2);
        if (y>x) serr("15-катор 1-устун раками ва I-булим 2-жадвал 20-катор устунлари, 22-катор устунлари, 24-катор устунлари, 27-катор устунлари йигиндиси I-булим 2-жадвал 14-катор 1-2 устунлар йигиндисидан катта еки тенг булиши керак яъни"+y+">"+x);

        return kerr_serr(m);
    }
    String findError10(int m) {
        for (int i=1; i<5; i++) if (get(rows,zpt,i,1)<get(rows,zpt,i+4,1)) {
            int j=i+4; serr("Жадвалнинг "+i+"-катор 1-устунидаги ракам "+j+"-катор 1-устунидаги ракамдан кам яъни "+get(rows,zpt,i,1)+"<"+get(rows,zpt,i+4,1));
        }
        for (int i=1; i<5; i++) if (get(rows,zpt,i,2)<get(rows,zpt,i+4,2)) {
            int j=i+4; serr("Жадвалнинг "+i+"-катор 2-устунидаги ракам "+j+"-катор 2-устунидаги ракамдан кам яъни "+get(rows,zpt,i,2)+"<"+get(rows,zpt,i+4,2));
        }
        if (get(rows,zpt,5,1)>get(rows_t2,zpt_t2,44,1))
         serr("II-бўлим 8-жадвалнинг 5-катор 1-устунидаги ракам I-бўлим 2-жадвалнинг 44-катор 1-устунидаги ракамдан кўп яъни "+get(rows,zpt,5,1)+">"+get(rows_t2,zpt_t2,44,1));
        if (get(rows,zpt,5,2)>get(rows_t2,zpt_t2,44,2))
         serr("II-бўлим 8-жадвалнинг 5-катор 2-устунидаги ракам I-бўлим 2-жадвалнинг 44-катор 2-устунидаги ракамдан кўп яъни "+get(rows,zpt,5,2)+">"+get(rows_t2,zpt_t2,44,2));
        if (get(rows,zpt,6,1)>get(rows_t2,zpt_t2,45,1))
         serr("II-бўлим 8-жадвалнинг 6-катор 1-устунидаги ракам I-бўлим 2-жадвалнинг 45-катор 1-устунидаги ракамдан кўп яъни "+get(rows,zpt,6,1)+">"+get(rows_t2,zpt_t2,45,1));
        if (get(rows,zpt,6,2)>get(rows_t2,zpt_t2,45,2))
         serr("II-бўлим 8-жадвалнинг 6-катор 2-устунидаги ракам I-бўлим 2-жадвалнинг 45-катор 2-устунидаги ракамдан кўп яъни "+get(rows,zpt,6,2)+">"+get(rows_t2,zpt_t2,45,2));
        if (get(rows,zpt,7,1)>get(rows_t2,zpt_t2,47,1))
         serr("II-бўлим 8-жадвалнинг 7-катор 1-устунидаги ракам I-бўлим 2-жадвалнинг 47-катор 1-устунидаги ракамдан кўп яъни "+get(rows,zpt,7,1)+">"+get(rows_t2,zpt_t2,47,1));
        if (get(rows,zpt,7,2)>get(rows_t2,zpt_t2,47,2))
         serr("II-бўлим 8-жадвалнинг 7-катор 2-устунидаги ракам I-бўлим 2-жадвалнинг 47-катор 2-устунидаги ракамдан кўп яъни "+get(rows,zpt,7,2)+">"+get(rows_t2,zpt_t2,47,2));
        if (get(rows,zpt,8,1)>get(rows_t2,zpt_t2,48,1))
         serr("II-бўлим 8-жадвалнинг 8-катор 1-устунидаги ракам I-бўлим 2-жадвалнинг 48-катор 1-устунидаги ракамдан кўп яъни "+get(rows,zpt,8,1)+">"+get(rows_t2,zpt_t2,48,1));
        if (get(rows,zpt,8,2)>get(rows_t2,zpt_t2,48,2))
         serr("II-бўлим 8-жадвалнинг 8-катор 2-устунидаги ракам I-бўлим 2-жадвалнинг 48-катор 2-устунидаги ракамдан кўп яъни "+get(rows,zpt,8,2)+">"+get(rows_t2,zpt_t2,48,2));

        return kerr_serr(m);
    }
    String findError11(int m) {

        return kerr_serr(m);
    }
    String findError12(int m) {
/*
        for (int i=1; i<4; i++) {
            int x=get(rows,zpt,2,i); int y=get(rows_t2,zpt_t2,3,i);
            if (x<y) serr("2-катор "+i+"-устундаги ракам 3-катор "+i+"-устундаги ракамдан катта еки тенг булиши керак яъни "+x+"<"+y);
        }
*/
        int x=get(rows,zpt,1,1); int y=get(rows,zpt,2,1)+get(rows,zpt,3,1);
        if (x<y) serr("1-катор 1-устундаги ракам 2-катор 1-устундаги ракам ва 3-катор 1-устундаги ракамлар йигиндисидан катта ёки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,2); y=get(rows,zpt,2,2)+get(rows,zpt,3,2);
        if (x<y) serr("1-катор 2-устундаги ракам 2-катор 2-устундаги ракам ва 3-катор 2-устундаги ракамлар йигиндисидан катта ёки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,1,3); y=get(rows,zpt,2,3)+get(rows,zpt,3,3);
        if (x<y) serr("1-катор 3-устундаги ракам 2-катор 3-устундаги ракам ва 3-катор 3-устундаги ракамлар йигиндисидан катта ёки тенг бўлиши керак яъни "+x+"<"+y);

        x=get(rows,zpt,4,1); y=get(rows,zpt,5,1);
        if (x<y) serr("4-катор 1-устундаги ракам 5-катор 1-устунидаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,4,2); y=get(rows,zpt,5,2);
        if (x<y) serr("4-катор 2-устундаги ракам 5-катор 2-устунидаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);
        x=get(rows,zpt,4,3); y=get(rows,zpt,5,3);
        if (x<y) serr("4-катор 3-устундаги ракам 5-катор 3-устунидаги ракамдан катта ёки тенг бўлиши керак яъни "+x+"<"+y);


        return kerr_serr(m);
    }
    public KeyF8(Buhuchet signinx,ParamsTables z,JTextComponent[][] rowsx) {
        signin=signinx; zpt=z; rows=rowsx; String[] sx=zpt.dbName.split("_"); if (sx.length==1) return;
        if (sx[0].equals("t2")||sx[0].equals("xt2")||sx[0].equals("t4")||sx[0].equals("xt4")) {
           String dbn="t1_"+sx[1]+"_"+sx[2]+"_"+sx[3];
           if (sx[0].equals("xt2")||sx[0].equals("xt4")) dbn="xt1_"+sx[1]+"_"+sx[2]+"_"+sx[3];
           zpt_t1=new ParamsTables(signin,"t1");
           rows_t1=signin.sql.getVector("select * from "+dbn+" order by p0 asc",zpt_t1);

           dbn="t5_"+sx[1]+"_"+sx[2]+"_"+sx[3];
           if (sx[0].equals("xt2")||sx[0].equals("xt4")) dbn="xt5_"+sx[1]+"_"+sx[2]+"_"+sx[3];
           zpt_t5=new ParamsTables(signin,"t5");
           rows_t5=signin.sql.getVector("select * from "+dbn+" order by p0 asc",zpt_t5);

           dbn="t6_"+sx[1]+"_"+sx[2]+"_"+sx[3];
           if (sx[0].equals("xt2")||sx[0].equals("xt4")) dbn="xt6_"+sx[1]+"_"+sx[2]+"_"+sx[3];
           zpt_t6=new ParamsTables(signin,"t6");
           rows_t6=signin.sql.getVector("select * from "+dbn+" order by p0 asc",zpt_t6);
        }
        if (sx[0].equals("t2")||sx[0].equals("xt2")) {
           String dbn="t4_"+sx[1]+"_"+sx[2]+"_"+sx[3];
           if (sx[0].equals("xt2")) dbn="xt4_"+sx[1]+"_"+sx[2]+"_"+sx[3];
           zpt_t4=new ParamsTables(signin,"t4");
           rows_t4=signin.sql.getVector("select * from "+dbn+" order by p0 asc",zpt_t4);
        }
        if (sx[0].equals("t4")||sx[0].equals("xt4")||sx[0].equals("t10")||sx[0].equals("xt10")) {
           String dbn="t2_"+sx[1]+"_"+sx[2]+"_"+sx[3];
           if (sx[0].equals("xt4")||sx[0].equals("xt10")) dbn="xt2_"+sx[1]+"_"+sx[2]+"_"+sx[3];
           zpt_t2=new ParamsTables(signin,"t2");
           rows_t2=signin.sql.getVector("select * from "+dbn+" order by p0 asc",zpt_t2);
        }
        if (sx[0].equals("t6")||sx[0].equals("xt6")) {
           String dbn="t5_"+sx[1]+"_"+sx[2]+"_"+sx[3]; if (sx[0].equals("xt6")) dbn="xt5_"+sx[1]+"_"+sx[2]+"_"+sx[3];
           zpt_t5=new ParamsTables(signin,"t5");
           rows_t5=signin.sql.getVector("select * from "+dbn+" order by p0 asc",zpt_t5);         
        }
        if (sx[0].equals("t9")||sx[0].equals("xt9")) {
           String dbn="t2_"+sx[1]+"_"+sx[2]+"_"+sx[3]; if (sx[0].equals("xt9")) dbn="xt2_"+sx[1]+"_"+sx[2]+"_"+sx[3];
           zpt_t2=new ParamsTables(signin,"t2");
           rows_t2=signin.sql.getVector("select * from "+dbn+" order by p0 asc",zpt_t2);
           dbn="t6_"+sx[1]+"_"+sx[2]+"_"+sx[3]; if (sx[0].equals("xt9")) dbn="xt6_"+sx[1]+"_"+sx[2]+"_"+sx[3];
           zpt_t6=new ParamsTables(signin,"t6");
           rows_t6=signin.sql.getVector("select * from "+dbn+" order by p0 asc",zpt_t6);
/*
           dbn="t9_"+sx[1]+"_"+sx[2]+"_"+sx[3]; if (sx[0].equals("xt9")) dbn="xt9_"+sx[1]+"_"+sx[2]+"_"+sx[3];
           zpt_t9=new ParamsTables(signin,"t9");
           rows_t9=signin.sql.getVector("select * from "+dbn+" order by p0 asc",zpt_t9);
*/
        }
    }
    int get(JTextComponent[][] rows,ParamsTables zpt,int row,int col) {
        if (rows==null) return 0;
        int l=0; row=zpt.rowEdit+row; col=zpt.colEdit+col;
        int k=0; String x=rows[row][col].getText().trim();
        if (!x.equals("")) {try {k=new Integer(x);} catch (NumberFormatException e) {l=1;}}
        if (l==1) k=0; return k;
    }    
    String findErrorx0(int m) {return kerr_serr(m);}
}